{
    "cik": "1652044",
    "company": "Alphabet Inc.",
    "filing_type": "10-Q",
    "filing_date": "2025-10-30",
    "period_of_report": "2025-09-30",
    "sic": "7370",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1652044/0001652044-25-000091-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1652044/000165204425000091/goog-20250930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1652044/0001652044-25-000091.txt",
    "filename": "1652044_10Q_2025_0001652044-25-000091.htm",
    "part_1": "PART I. FINANCIAL INFORMATION\nITEM 1.FINANCIAL STATEMENTS\nAlphabet Inc.\nCONSOLIDATED BALANCE SHEETS\n(in millions, except par value per share amounts)\nSee accompanying notes.\nAlphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF INCOME\n(in millions, except per share amounts; unaudited)\nSee accompanying notes.\nAlphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in millions; unaudited)\nSee accompanying notes.\nAlphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(in millions; unaudited)\nAlphabet Inc.\nSee accompanying notes.\nAlphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions; unaudited)\nSee accompanying notes.\nAlphabet Inc.\nAlphabet Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nNote 1. Summary of Significant Accounting Policies\nNature of Operations\nGoogle was incorporated in California in September 1998 and re-incorporated in the State of Delaware in August 2003. In 2015, we implemented a holding company reorganization, and as a result, Alphabet Inc. (\"Alphabet\") became the successor issuer to Google.\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices.\nBasis of Consolidation\nThe consolidated financial statements of Alphabet include the accounts of Alphabet and entities consolidated under the variable interest and voting models. Intercompany balances and transactions have been eliminated.\nUnaudited Interim Financial Information\nThese unaudited interim consolidated financial statements have been prepared in accordance with generally accepted accounting principles in the United States (GAAP), and in our opinion, include all adjustments of a normal recurring nature necessary for fair financial statement presentation. Interim results are not necessarily indicative of the results to be expected for the full year ending December 31, 2025. We have made estimates and assumptions that affect the amounts reported and disclosed in the financial statements and the accompanying notes. Actual results could differ materially from these estimates.\nThese consolidated financial statements and other information presented in this Form 10-Q should be read in conjunction with the consolidated financial statements and the related notes included in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 filed with the SEC.\nRecently Issued Accounting Pronouncements Not Yet Adopted\nIn December 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-09 \"Income Taxes (Topics 740): Improvements to Income Tax Disclosures\" to expand the disclosure requirements for income taxes. Upon adoption, we will be required to disclose additional specified categories in the rate reconciliation in both percentage and dollar amounts. We will also be required to disclose the amount of income taxes paid disaggregated by jurisdiction, among other disclosure requirements. The standard, which is effective for our 2025 annual period, will be applied retrospectively.\nIn November 2024, the FASB issued ASU 2024-03 \"Income Statement: Reporting Comprehensive Income-Expense Disaggregation Disclosures (Subtopic 220-40)\" to improve the disclosures about an entity’s expenses. Upon adoption, we will be required to disclose in the notes to the financial statements a disaggregation of certain expense categories included within the expense captions on the face of the income statement. The standard is effective for our 2027 annual period, and our interim periods beginning in 2028, with early adoption permitted. The standard can be applied either prospectively or retrospectively. We are currently assessing adoption timing and the effect that the updated standard will have on our financial statement disclosures.\nIn September 2025, the FASB issued ASU 2025-06 \"Intangibles: Goodwill and Other-Internal-Use Software (Subtopic 350-40): Targeted Improvements to the Accounting for Internal-Use Software\" to modernize the accounting for software costs under Subtopic 350-40, Intangibles-Goodwill and Other-Internal-Use Software (referred to as “internal-use software”). Upon adoption, we will be required to account for internal-use software under the updated capitalization criteria. The standard is effective for our interim and annual 2028 periods, with early adoption permitted. The standard can be applied either prospectively, retrospectively, or under a modified transition approach. We are currently assessing adoption timing and the method of adoption.\nPrior Period Reclassifications\nCertain amounts in prior periods have been reclassified to conform with current period presentation.\nAlphabet Inc.\nNote 2. Revenues\nDisaggregated Revenues\nThe following table presents revenues disaggregated by type (in millions):\nThe following table presents revenues disaggregated by geography, based on the addresses of our customers (in millions):\n(1) Regions represent Europe, the Middle East, and Africa (EMEA); Asia-Pacific (APAC); and Canada and Latin America (\"Other Americas\").\nRevenue Backlog\nAs of September 30, 2025, we had $157.7 billion of remaining performance obligations (“revenue backlog”), primarily related to Google Cloud. Revenue backlog represents commitments in customer contracts that have not yet been recognized as revenue. We expect to recognize just over 55% of the revenue backlog as revenues over the next 24 months with the remainder to be recognized thereafter. The estimated revenue backlog and timing of revenue recognition for these commitments is largely driven by our ability to deliver in accordance with relevant contract terms and when our customers utilize services. Revenue backlog includes related deferred revenue currently recorded as well as amounts that will be invoiced in future periods, and excludes contracts with an original expected term of one year or less and cancellable contracts.\nDeferred Revenues\nWe record deferred revenues when cash payments are received or due in advance of our performance, including amounts which are refundable. Deferred revenues primarily relate to Google Cloud and Google subscriptions, platforms, and devices. Total deferred revenue as of December 31, 2024 was $6.0 billion, of which $4.1 billion was recognized as revenues for the nine months ended September 30, 2025. Total deferred revenue as of September 30, 2025 was $7.4 billion.\nNote 3. Financial Instruments\nFair Value Measurements\nInvestments Measured at Fair Value on a Recurring Basis\nCash, cash equivalents, and marketable equity securities are measured at fair value and classified within\nAlphabet Inc.\nLevel 1 and Level 2 in the fair value hierarchy, because we use quoted prices for identical assets in active markets or inputs that are based upon quoted prices for similar instruments in active markets.\nDebt securities are measured at fair value and classified within Level 2 in the fair value hierarchy, because we use quoted market prices to the extent available or alternative pricing sources and models utilizing market observable inputs to determine fair value. For certain marketable debt securities, we have elected the fair value option for which changes in fair value are recorded in OI&E. The fair value option was elected for these securities to align with the unrealized gains and losses from related derivative contracts.\nThe following tables summarize our cash, cash equivalents, and marketable securities measured at fair value on a recurring basis (in millions):\n(1)Represents gross unrealized gains and losses for debt securities recorded to accumulated other comprehensive income (AOCI).\n(2)The long-term portion of marketable equity securities (subject to long-term lock-up restrictions) of $266 million as of December 31, 2024 is included within other non-current assets.\nAlphabet Inc.\n(1)Represents gross unrealized gains and losses for debt securities recorded to AOCI.\nInvestments Measured at Fair Value on a Nonrecurring Basis\nOur non-marketable equity securities are investments in privately held companies without readily determinable market values. The carrying value of our non-marketable equity securities is adjusted to fair value upon observable transactions for identical or similar investments of the same issuer or impairment. Non-marketable equity securities that have been remeasured during the period based on observable transactions are classified within Level 2 or Level 3 in the fair value hierarchy. Non-marketable equity securities that have been remeasured due to impairment are classified within Level 3. Our valuation methods include option pricing models, market comparable approach, and common stock equivalent method, which may include a combination of the observable transaction price at the transaction date and other unobservable inputs including volatility, expected time to exit, risk free rate, and the rights, and obligations of the securities we hold. These inputs vary significantly based on investment type.\nAs of September 30, 2025, the carrying value of our non-marketable equity securities was $61.1 billion, of which $38.9 billion was remeasured at fair value during the three months ended September 30, 2025 and was primarily classified within Level 2 of the fair value hierarchy at the time of measurement.\nAlphabet Inc.\nDebt Securities\nThe following table summarizes the estimated fair value of investments in available-for-sale marketable debt securities by effective contractual maturity dates (in millions):\nThe following tables present fair values and gross unrealized losses recorded to AOCI, aggregated by investment category and the length of time that individual securities have been in a continuous loss position (in millions):\nWe determine realized gains or losses on the sale or extinguishment of debt securities on a specific identification method. The following table summarizes gains and losses for debt securities, reflected as a component of OI&E (in millions):\nEquity Investments\nThe carrying value of equity securities is measured as the total initial cost plus the cumulative net gain (loss). Gains and losses, including impairments, are included as a component of OI&E in the Consolidated Statements of Income. See Note 7 for further details on OI&E. Certain of our non-marketable equity securities include our investments in variable interest entities (VIEs) where we are not the primary beneficiary. See Note 5 for further details on VIEs.\nAlphabet Inc.\nThe carrying values for marketable and non-marketable equity securities are summarized below (in millions):\n(1)Non-marketable equity securities cumulative net gain (loss) is comprised of $22.7 billion and $42.9 billion of gains and $8.4 billion and $8.9 billion of losses (including impairments) as of December 31, 2024 and September 30, 2025, respectively.\nGains and Losses on Marketable and Non-marketable Equity Securities\nGains and losses (including impairments), net, for marketable and non-marketable equity securities included in OI&E are summarized below (in millions):\n(1)Unrealized gain (loss) on non-marketable equity securities accounted for under the measurement alternative is comprised of $1.9 billion and $10.6 billion of upward adjustments and $412 million and $346 million of downward adjustments (including impairments) for the three months ended September 30, 2024 and 2025, respectively, and $5.0 billion and $20.9 billion of upward adjustments and $2.0 billion and $1.2 billion of downward adjustments (including impairments) for the nine months ended September 30, 2024 and 2025, respectively.\nIn the table above, realized net gain (loss) on equity securities sold during the period reflects the difference between the sale proceeds and the carrying value of the equity securities at the beginning of the period or the purchase date, if later.\nCumulative net gains (losses) on equity securities sold during the period, which is summarized in the following table (in millions), represents the total net gains (losses) recognized after the initial purchase date of the equity security sold during the period. While these net gains (losses) may have been reflected in periods prior to the period of sale, we believe they are important supplemental information as they reflect the economic net gains (losses) on the securities sold during the period. Cumulative net gains (losses) are calculated as the difference between the sale price and the initial purchase price for the equity security sold during the period.\nEquity Securities Accounted for Under the Equity Method\nAs of December 31, 2024 and September 30, 2025, equity securities accounted for under the equity method had a carrying value of approximately $2.0 billion and $2.3 billion, respectively. Our share of gains and losses, including impairments, are included as a component of OI&E, in the Consolidated Statements of Income. See Note 7 for further details on OI&E. Certain of our equity method securities include our investments in VIEs where we are not the primary beneficiary. See Note 5 for further details on VIEs.\nConvertible Notes\nAlphabet Inc.\nAs of December 31, 2024 and September 30, 2025, we had investments in convertible notes of $2.9 billion and $1.3 billion, respectively. During the nine months ended September 30, 2025, we made additional investments in convertible notes totaling $1.1 billion and converted $3.0 billion of our convertible notes into equity securities, which included gains from conversion of $418 million. These gains were recognized in OI&E within the Consolidated Statement of Income. See Note 7 for further details on OI&E.\nDerivative Financial Instruments\nWe primarily use derivative instruments to manage risks relating to our ongoing business operations. The primary risk managed is foreign exchange risk. We use foreign currency contracts to reduce the risk that our cash flows, earnings, and investment in foreign subsidiaries will be adversely affected by foreign currency exchange rate fluctuations. We also enter into derivative instruments to partially offset our exposure to other risks and enhance investment returns.\nWe recognize derivative instruments in the Consolidated Balance Sheets at fair value and classify the derivatives primarily within Level 2 in the fair value hierarchy. We present our collar contracts (an option strategy comprised of a combination of purchased and written options) at net fair values and present all other derivatives at gross fair values. The accounting treatment for derivatives is based on the intended use and hedge designation.\nCash Flow Hedges\nWe designate foreign currency forward and option contracts (including collars) as cash flow hedges to hedge certain forecasted revenue transactions denominated in currencies other than the United States (U.S.) dollar. These contracts have maturities of 24 months or less.\nCash flow hedge amounts included in the assessment of hedge effectiveness are deferred in AOCI and subsequently reclassified to revenue when the hedged item is recognized in earnings. We exclude forward points and time value from our assessment of hedge effectiveness and amortize them on a straight-line basis over the life of the hedging instrument in revenues. The difference between fair value changes of the excluded component and the amount amortized to revenues is recorded in AOCI.\nAs of September 30, 2025, the net accumulated loss on our foreign currency cash flow hedges before tax effect was $257 million, which is expected to be reclassified from AOCI into revenues within the next 12 months.\nFair Value Hedges\nWe designate foreign currency forward contracts as fair value hedges to hedge foreign currency risks for our marketable securities denominated in currencies other than the U.S. dollar. Fair value hedge amounts included in the assessment of hedge effectiveness are recognized in OI&E, along with the offsetting gains and losses of the related hedged items. We exclude forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in OI&E.\nNet Investment Hedges\nWe designate foreign currency forward contracts, option contracts (including collars), and foreign currency-denominated debt as net investment hedges to hedge the foreign currency risks related to our investment in foreign subsidiaries. Net investment hedge amounts included in the assessment of hedge effectiveness are recognized in AOCI along with the foreign currency translation adjustment. For derivative instruments, we exclude forward points and time value from the assessment of hedge effectiveness and recognize changes in the excluded component in OI&E.\nWe had no foreign currency-denominated debt as of December 31, 2024 and $7.8 billion carrying value of foreign currency-denominated debt designated as net investment hedges as of September 30, 2025.\nOther Derivatives\nWe enter into foreign currency forward and option contracts that are not designated as hedging instruments to hedge intercompany transactions and other monetary assets or liabilities denominated in currencies other than the functional currency of a subsidiary. Gains and losses on these derivatives that are not designated as accounting hedges are primarily recorded in OI&E along with the foreign currency gains and losses on monetary assets and liabilities.\nWe also use derivatives not designated as hedging instruments to manage risks relating to interest rates, commodity prices, credit exposures, the market price of certain marketable equity securities, and to enhance investment returns. Additionally, we have credit derivative instruments resulting from agreements with third parties\nto backstop certain obligations relating to data center leases. Gains and losses arising from other derivatives are primarily reflected within the “other” component of OI&E. See Note 7 for further details.\nThe gross notional amounts of outstanding derivative instruments were as follows (in millions):\n(1) Notional amounts for credit derivatives are the backstop obligations related to certain third party data center leases and represent the maximum potential amount of future payments that could be required in the event of certain default scenarios, upon which we may receive equity in or cash payments from certain counterparties. See Note 5 for further details.\nThe fair values of outstanding derivative instruments were as follows (in millions):\n(1) Derivative assets are recorded as other current and non-current assets in the Consolidated Balance Sheets.\n(2) Derivative liabilities are recorded as accrued expenses and other liabilities, current and non-current in the Consolidated Balance Sheets.\nThe gains (losses) on derivatives and non-derivative financial instruments in cash flow hedging and net investment hedging relationships recognized in other comprehensive income (OCI) are summarized below (in millions):\nThe table below presents the gains (losses) of derivatives included in the Consolidated Statements of Income: (in millions):\nOffsetting of Derivatives\nWe enter into master netting arrangements and collateral security arrangements to reduce credit risk. Cash collateral received related to derivative instruments under our collateral security arrangements are included in other current assets with a corresponding liability. Cash and non-cash collateral pledged related to derivative instruments under our collateral security arrangements are included in other current assets.\nThe gross amounts of derivative instruments subject to master netting arrangements with various counterparties, and cash and non-cash collateral received and pledged under such agreements were as follows (in millions):\n(1)The balances as of December 31, 2024 and September 30, 2025 were related to derivatives allowed to be net settled in accordance with our master netting agreements.\nNote 4. Leases\nWe have entered into operating and finance lease agreements primarily for data centers, land, and offices throughout the world with varying lease terms.\nComponents of lease costs were as follows (in millions):\nSupplemental information related to leases was as follows (in millions):\nSupplemental cash flow information related to leases was as follows (in millions):\n(1)Financing cash flows used for financing leases are included within financing activities of the Consolidated Statements of Cash Flows as repayments of debt.\nFuture lease payments as of September 30, 2025 were as follows (in millions):\nAs of September 30, 2025, we have entered into leases primarily related to data centers that have not yet commenced with future lease payments of $42.6 billion, including a purchase option considered reasonably certain to be exercised, that are not yet recorded on our Consolidated Balance Sheet. These leases will commence between 2025 and 2031 with non-cancelable lease terms between one and 25 years.\nNote 5. Variable Interest Entities\nConsolidated VIEs\nWe consolidate VIEs in which we hold a variable interest and are the primary beneficiary. The results of operations and financial position of these VIEs are included in our consolidated financial statements.\nFor certain consolidated VIEs, their assets are not available to us, and their creditors do not have recourse to us. As of December 31, 2024 and September 30, 2025, assets that can only be used to settle obligations of these VIEs were $8.7 billion and $6.2 billion, respectively, and are primarily included in cash and cash equivalents on our Consolidated Balance Sheets. As of December 31, 2024 and September 30, 2025, liabilities for which creditors only have recourse to the VIEs were $2.3 billion and $1.8 billion, respectively. We may continue to fund ongoing operations of certain VIEs that are included within Other Bets.\nTotal noncontrolling interests (NCI) in our consolidated subsidiaries were $4.2 billion and $3.9 billion as of December 31, 2024 and September 30, 2025, respectively, of which $1.1 billion and $853 million were redeemable noncontrolling interests (RNCI) as of December 31, 2024 and September 30, 2025, respectively. NCI and RNCI are included within additional paid-in capital. Net loss attributable to noncontrolling interests was not material for any period presented and is included within the \"other\" component of OI&E. See Note 7 for further details on OI&E.\nUnconsolidated VIEs\nWe have interests in VIEs in which we are not the primary beneficiary. These VIEs include private companies that are primarily early stage companies, certain renewable energy entities in which activities involve power generation using renewable sources, and certain data center leasing entities.\nWe have determined that the governance structures of these entities do not allow us to direct the activities that would significantly affect their economic performance. Therefore, we are not the primary beneficiary, and the results of operations and financial position of these VIEs are not included in our consolidated financial statements.\nWe primarily account for our investments in private companies and renewable energy entities as non-marketable equity securities or equity method investments, which are included within non-marketable securities on our Consolidated Balance Sheets. The maximum exposure of these unconsolidated VIEs is generally based on the current carrying value of the investments and any future funding commitments. As of December 31, 2024 and September 30, 2025, our future funding commitments related to unconsolidated VIE investments were $1.5 billion and $860 million, respectively.\nWe account for our variable interests in certain data center leasing entities, which are in the form of credit backstop agreements as credit derivatives. The fair value of the credit derivatives are not material as of September 30, 2025. Our maximum exposure to loss for these unconsolidated VIEs is limited to our financial risk under certain default scenarios over remaining agreement periods of up to 10 years, to either pay a termination fee or assume the lease. As of September 30, 2025, the maximum exposure to loss is $6.5 billion. See Note 3 for further details on derivatives.\nNote 6. Debt\nShort-Term Debt\nWe have a short-term debt financing program of up to $25.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. We had $2.3 billion and $3.0 billion of commercial paper outstanding as of December 31, 2024 and September 30, 2025, respectively, with a weighted-average effective interest rate of 4.4% and 4.1%, respectively. The estimated fair value of the commercial paper approximated its carrying value as of December 31, 2024 and September 30, 2025.\nOur short-term debt balance also includes the current portion of certain long-term debt.\nLong-Term Debt\nIn May 2025, we issued $5.0 billion of U.S. dollar-denominated fixed-rate senior unsecured notes in four tranches: $750 million of 4.00% notes due 2030, $1.25 billion of 4.50% notes due 2035, $1.5 billion of 5.25% notes due 2055, and $1.5 billion of 5.30% notes due 2065. Additionally in May 2025, we issued €6.75 billion of euro-denominated fixed-rate senior unsecured notes in five tranches: €1.5 billion of 2.50% notes due 2029, €1.5 billion of 3.00% notes due 2033, €1.25 billion of 3.38% notes due 2037, €1.25 billion of 3.88% notes due 2045, and €1.25 billion of 4.00% notes due 2054. The net proceeds from all notes issued in May 2025 are used for general corporate purposes.\nTotal outstanding long-term debt is summarized below (in millions, except percentages):\n(1)Principal, unamortized discount, and debt issuance costs for the euro-denominated notes include the effect of foreign exchange rates.\n(2)Total current portion of long-term debt is included within accrued expenses and other current liabilities. See Note 7 for further details.\nThe notes in the table above are fixed-rate senior unsecured obligations and rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually, except for the euro-denominated notes, which are payable annually.\nThe total estimated fair value of the outstanding notes was approximately $9.0 billion and $21.1 billion as of December 31, 2024 and September 30, 2025, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy.\nCredit Facility\nAs of September 30, 2025, we had $10.0 billion of revolving credit facilities, of which $4.0 billion expires in April 2026 and $6.0 billion expires in April 2030. The interest rates for all credit facilities are determined based on a formula using certain market rates. No amounts were outstanding under the credit facilities as of December 31, 2024 and September 30, 2025.\nNote 7. Supplemental Financial Statement Information\nAccounts Receivable\nThe allowance for credit losses on accounts receivable was $879 million and $918 million as of December 31, 2024 and September 30, 2025, respectively.\nProperty and Equipment, Net\nProperty and equipment, net, consisted of the following (in millions):\n(1) As of December 31, 2024 and September 30, 2025, approximately 60% of technical infrastructure assets were comprised of servers and network equipment. The remaining balance was comprised of data center land and buildings and related assets.\nAccrued Expenses and Other Current Liabilities\nAccrued expenses and other current liabilities consisted of the following (in millions):\n(1) Additional property and equipment purchases of $3.2 billion and $5.7 billion as of December 31, 2024 and September 30, 2025, respectively, were included in accounts payable.\n(2) The amounts related to the European Commission (EC) fines, including any under appeal, are included in accrued expenses and other current liabilities on our Consolidated Balance Sheets. Amounts include the effects of foreign exchange and interest. See Note 10 for further details.\n(3) As of September 30, 2025, other accrued expenses and current liabilities included a $1.4 billion accrual for settlement of certain privacy matters. See Note 10 for further details.\nAccumulated Other Comprehensive Income (Loss)\nComponents of AOCI, net of income tax, were as follows (in millions):\nThe effects on net income of amounts reclassified from AOCI were as follows (in millions):\nOther Income (Expense), Net\nComponents of OI&E were as follows (in millions):\n(1)Interest expense is net of interest capitalized of $57 million and $130 million for the three months ended September 30, 2024 and 2025, respectively, and $143 million and $301 million for the nine months ended September 30, 2024 and 2025, respectively.\nNote 8. Acquisitions\nPending Acquisition\nIn March 2025, we entered into a definitive agreement to acquire Wiz, a leading cloud security platform, for $32.0 billion, subject to closing adjustments, in an all-cash transaction. The acquisition of Wiz is expected to close in 2026, subject to customary closing conditions, including the receipt of regulatory approvals. Upon the close of the acquisition, Wiz will be part of the Google Cloud segment.\nNote 9. Goodwill\nChanges in the carrying amount of goodwill for the nine months ended September 30, 2025 were as follows (in millions):\nNote 10. Commitments and Contingencies\nCommitments\nWe have content licensing agreements with future fixed or minimum guaranteed commitments of $7.7 billion as of September 30, 2025, of which the majority is paid quarterly through the first quarter of 2030.\nIndemnifications\nIn the normal course of business, including to facilitate transactions in our services and products and corporate activities, we indemnify certain parties, including advertisers, Google Network partners, distribution partners, customers of Google Cloud offerings, lessors, and service providers with respect to certain matters. We have agreed to defend and/or indemnify certain parties against losses arising from a breach of representations or covenants, or out of intellectual property infringement or other claims made against certain parties. Several of these agreements limit the time within which an indemnification claim can be made and the amount of the claim. In addition, we have entered into indemnification agreements with our officers and directors, and our bylaws contain similar indemnification obligations to our agents.\nIt is not possible to make a reasonable estimate of the maximum potential amount under these indemnification agreements due to the unique facts and circumstances involved in each particular agreement. Additionally, the payments we have made under such agreements have not had a material adverse effect on our results of operations, cash flows, or financial position. However, to the extent that valid indemnification claims arise in the future, future payments by us could be significant and could have a material adverse effect on our results of operations or cash flows in a particular period.\nAs of September 30, 2025, we did not have any material indemnification claims that were probable or reasonably possible.\nLegal Matters\nWe record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate.\nCertain outstanding matters seek speculative, substantial or indeterminate monetary amounts, substantial changes to our business practices and products, or structural remedies. Significant judgment is required to determine both the likelihood of there being a loss and the estimated amount of a loss related to such matters, and we may be unable to estimate the reasonably possible loss or range of losses. The outcomes of outstanding legal matters are inherently unpredictable and subject to significant uncertainties, and could, either individually or in aggregate, have a material adverse effect.\nWe expense legal fees in the period in which they are incurred.\nAntitrust Matters\nWe are subject to formal and informal inquiries and investigations as well as litigation on various competition matters by regulatory authorities and private parties in the U.S., Europe, and other jurisdictions globally, including the following:\n•Shopping: In June 2017, the EC announced its decision that certain actions taken by Google relating to its display and ranking of shopping search results and ads infringed European antitrust laws and imposed a €2.4 billion fine. In 2024, we made a cash payment of $3.0 billion for the fine.\n•Android: In July 2018, the EC announced its decision that certain provisions in Google's Android-related distribution agreements infringed European antitrust laws, imposed a €4.3 billion fine, and directed the termination of the conduct at issue. We appealed the EC decision and implemented changes to certain of our Android distribution practices. In September 2022, the General Court affirmed the EC decision but reduced the fine from €4.3 billion to €4.1 billion. We subsequently appealed the General Court's affirmation of the EC decision with the European Court of Justice, which remains pending. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022.\n•AdSense for Search: In March 2019, the EC announced its decision that certain provisions in Google's agreements with AdSense for Search partners infringed European antitrust laws, imposed a fine of €1.5 billion, and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. In 2019, we recognized a charge of $1.7 billion for the fine and appealed the EC decision. In September 2024, the General Court overturned the EC decision and annulled the €1.5 billion fine. The EC has appealed the General Court's decision with the European Court of Justice.\n•Search: In October 2020, the U.S. Department of Justice (DOJ) and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia concerning Google's Search and Search advertising practices and its compliance with U.S. antitrust laws. In August 2024, the U.S. District Court for the District of Columbia ruled against Google. In September 2025, a decision on remedies was issued, which, among other things, imposes restrictions on how Google distributes its services, and requires Google to share certain search data with and offer syndication services to certain competitors. We expect a final judgment will be entered in late 2025.\nFurther, in June 2022, the Australian Competition and Consumer Commission (ACCC) opened an investigation into Search distribution practices. In August 2025, we agreed to a settlement with the ACCC requiring, among other things, changes to our Android agreements. Final approval of the settlement remains pending before the court.\nIn October 2023, the Japanese Fair Trade Commission (JFTC) opened an investigation into Search distribution practices. In April 2025, the JFTC issued a cease-and-desist order requiring us to make changes to our Android agreements to ensure they are consistent with Japanese antitrust law. The JFTC did not impose monetary penalties. We are constructively engaging with the JFTC regarding compliance with the order.\n•Advertising Technology: In December 2020, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Eastern District of Texas concerning Google's advertising technology and its compliance with U.S. antitrust laws and state deceptive trade laws. In January 2023, the DOJ, along with a number of state Attorneys General, filed a lawsuit in the U.S. District Court for the Eastern District of Virginia concerning Google's advertising technology and its compliance with U.S. antitrust laws, and a number of additional state Attorneys General subsequently joined the lawsuit. In April 2025, the U.S. District Court for the Eastern District of Virginia issued a mixed decision in the DOJ case against Google, ruling that Google's advertiser tools or acquisitions of DoubleClick and AdMeld were not anticompetitive, but that Google's publisher tools unfairly excluded rivals. A separate proceeding to determine remedies, the range of which vary widely, took place in September 2025, with the parties presenting differing remedy proposals. The DOJ's remedy proposal includes structural remedies that could have a material adverse effect on our business. We expect closing arguments to be held in November 2025, after which the court will issue its final judgment. After that judgment, we plan to appeal the adverse portion of the April 2025 decision and potentially aspects of the remedies decision. A trial in the state Attorneys General case in the Eastern District of Texas will take place after a decision on remedies is issued in the DOJ case. Given the nature of these matters, we cannot estimate a possible loss.\nFurther, in June 2023, the EC issued a Statement of Objections informing Google of its preliminary view that Google infringed European antitrust laws relating to its advertising technology. In September 2025, the EC announced its decision that Google had infringed European competition laws through \"self-preferencing\" practices on the buy-side and the sell-side relating to Google's advertising technology business. The EC decision imposed a €3.0 billion (approximately $3.5 billion as of September 5, 2025) fine and directed Google to cease and desist the alleged \"self-preferencing\" practices. We plan to appeal the ruling. We accrued the fine in the third quarter of 2025, resulting in a charge of $3.5 billion. We are currently engaging with the EC and a group of banking partners to place bank guarantees in the fourth quarter of 2025 in lieu of cash payment.\nIn September 2024, the UK also issued a Statement of Objections concerning Google's advertising technology and its compliance with UK antitrust laws, to which we responded.\n•Google Play: In July 2021, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Northern District of California concerning Google's operation of Android and Google Play and its compliance with U.S. antitrust laws and state antitrust and consumer protection laws. In September 2023, we reached a settlement in principle with 50 state Attorneys General and three territories and recognized a charge. Final approval of the settlement remains pending before the court. In May 2024, we funded the settlement amount to an escrow agent.\nIn December 2023, a California jury delivered a verdict against Google in Epic Games v. Google related to Google Play's business. Epic did not seek monetary damages. The presiding judge issued a remedies decision in October 2024, ordering a variety of alterations to our business models and operations and contractual agreements for Android and Google Play. We appealed the judgment, including the jury verdict and aspects of the remedies ordered, and in July 2025, the Court of Appeals denied our appeal. We are in the process of appealing that decision to the U.S. Supreme Court, and we implemented the ordered remedies in October 2025 while the appeal is pending.\n•European Digital Markets Act: In March 2024, the EC opened two investigations regarding Google's compliance with certain provisions of the European Union's (EU) Digital Markets Act relating to Google Play and Search. In March 2025, the EC issued preliminary findings of non-compliance in both investigations, to which we responded. Given the nature of this matter, we cannot estimate a possible loss.\nIn addition to these antitrust proceedings, private individual and collective actions that overlap with claims pursued by regulatory authorities are pending in the U.S. and in several other jurisdictions, including across Europe. Given the nature of these matters, we cannot estimate a possible loss.\nWe believe we have strong arguments against these open claims and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world.\nPrivacy Matters\nWe are subject to a number of privacy-related laws and regulations, and we currently are party to a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. For example, there are ongoing investigations and litigation in the U.S. and the EU, including those relating to our collection and use of location information, alleged violations of state biometric statutes, the choices we offer users, and advertising practices, which could result in significant fines, judgments, and product changes. In October 2025, we finalized a $1.4 billion settlement of certain privacy matters.\nPatent and Intellectual Property Claims\nWe have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products.\nFurther, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business.\nOther\nWe are subject to claims, lawsuits, regulatory and government inquiries and investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, AI training, and other matters. For example, we periodically have data incidents that we report to relevant regulators as required by law. Such claims, consent orders, lawsuits, regulatory and government investigations, and other proceedings could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results.\nWe have ongoing legal matters relating to Russia. For example, some matters concern civil judgments that include compounding penalties imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not expect these ongoing legal matters will have a material adverse effect.\nNon-Income Taxes\nWe are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations.\nSee Note 14 for information regarding income tax contingencies.\nNote 11. Stockholders' Equity\nShare Repurchases\nIn the three and nine months ended September 30, 2025, we continued to repurchase both Class A and Class C shares in a manner deemed in the best interest of the company and its stockholders, taking into account the economic cost and prevailing market conditions, including the relative trading prices and volumes of the Class A and Class C shares. During the three and nine months ended September 30, 2025, we repurchased $11.6 billion and $40.1 billion of Alphabet's Class A and Class C shares, respectively.\nIn April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its Class A and Class C shares. In April 2025, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of Class A and Class C shares. As of September 30, 2025, $74.8 billion remained available for Class A and Class C share repurchases.\nThe following table presents Class A and Class C shares repurchased and subsequently retired (in millions):\n(1) Shares repurchased include unsettled repurchases.\nRepurchases are executed from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases or privately negotiated transactions, including through Rule 10b5-1 plans. The repurchase program does not have an expiration date.\nDividends\nIn the three and nine months ended September 30, 2025, total cash dividends were $1.2 billion and $3.6 billion for Class A, $177 million and $527 million for Class B, and $1.1 billion and $3.4 billion for Class C shares, respectively.\nIn April 2025, the Board of Directors of Alphabet increased the quarterly cash dividend by 5% to $0.21 per share of outstanding Class A, Class B, and Class C shares.\nThe company has declared a quarterly cash dividend in the current quarter, and intends to pay quarterly cash dividends in the future, subject to review and approval by the company’s Board of Directors in its sole discretion.\nNote 12. Net Income Per Share\nThe following table sets forth the computation of basic and diluted net income per share of Class A, Class B, and Class C stock (in millions, except per share amounts):\n(1)Not applicable for consolidated net income per share.\n(1)Not applicable for consolidated net income per share.\nFor the periods presented above, the holders of each class are entitled to equal per share dividends or distributions in liquidation in accordance with the Amended and Restated Certificate of Incorporation of Alphabet Inc. Holders of Alphabet unvested stock units are awarded dividend equivalents, which are subject to the same vesting conditions as the underlying award, and settled in Class C shares.\nImmaterial differences in net income per share across our Class A, Class B, and Class C shares may arise due to the allocation of distributed earnings, which is based on the holders as of the record date, compared with the allocation of undistributed earnings and number of shares, which is based on the weighted average shares outstanding over the periods.\nNote 13. Compensation Plans\nStock-Based Compensation\nFor the three months ended September 30, 2024 and 2025, total stock-based compensation (SBC) expense was $5.9 billion and $6.4 billion, including amounts associated with awards we expect to settle in Alphabet stock of $5.7 billion and $6.1 billion, respectively. For the nine months ended September 30, 2024 and 2025, total SBC expense was $17.0 billion and $17.9 billion, including amounts associated with awards we expect to settle in Alphabet stock of $16.4 billion and $17.2 billion, respectively.\nStock-Based Award Activities\nThe following table summarizes the activities for unvested Alphabet restricted stock units (RSUs), which include dividend equivalents awarded to holders of unvested stock, for the nine months ended September 30, 2025 (in millions, except per share amounts):\nAs of September 30, 2025, there was $47.0 billion of unrecognized compensation cost related to unvested RSUs. This amount is expected to be recognized over a weighted-average period of 2.6 years.\nNote 14. Income Taxes\nThe following table presents provision for income taxes (in millions, except for effective tax rate):\nWe are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. The total amount of gross unrecognized tax benefits was $12.6 billion and $13.1 billion, of which $10.0 billion and $11.1 billion, if recognized, would affect our effective tax rate, as of December 31, 2024 and September 30, 2025, respectively.\nChanges to U.S. tax law enacted on July 4, 2025, allow for immediate expensing of domestic research and experimentation costs, accelerated depreciation on eligible capital expenditures, and other tax law changes impacting 2025 with certain changes effective in 2026. These changes are reflected in our results for the three and nine months ended September 30, 2025.\nNote 15. Information about Segments and Geographic Areas\nWe report our segment results as Google Services, Google Cloud, and Other Bets:\n•Google Services includes products and services such as ads, Android, Chrome, devices, Google Maps, Google Play, Search, and YouTube. Google Services generates revenues primarily from advertising; fees received for consumer subscription-based products such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as Google One; the sale of apps and in-app purchases; and devices.\n•Google Cloud includes infrastructure and platform services, applications, and other services for enterprise customers. Google Cloud generates revenues primarily from consumption-based fees and subscriptions received for Google Cloud Platform services, Google Workspace communication and collaboration tools, and other enterprise services.\n•Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of autonomous transportation services, healthcare-related services, and internet services.\nRevenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and devices, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. These costs, including the associated depreciation, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue.\nCertain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include certain AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with employee severance and office space reductions are also not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments.\nOur Chief Operating Decision Maker (CODM) is our Chief Executive Officer, Sundar Pichai. Our CODM uses segment operating income (loss) to allocate resources to our segments in our annual planning process and to assess the performance of our segments, primarily by monitoring actual results versus the annual plan. Our operating segments are not evaluated using asset information.\nThe following table presents revenue, profitability, and expense information about our segments (in millions):(1) Includes the EC fine of $3.5 billion for the three and nine months ended September 30, 2025.\nGoogle Services and Google Cloud employee compensation expenses include the costs associated with direct and allocated employees. Google Services and Google Cloud other costs and expenses primarily include direct costs, such as advertising and promotional activities and third-party services fees as well as allocated costs, such as technical infrastructure and office facilities usage costs. Additionally, Google Services other costs and expenses include content and traffic acquisition costs and device costs.\nSee Note 2 for information relating to revenues by geography.\nThe following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions):\nITEM 2.MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together with \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes included under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the fiscal year ended December 31, 2024, including Part I, Item 1A \"Risk Factors.\"\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses - the largest of which is Google. We report Google in two segments, Google Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further details on our segments, see Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices. For additional information on how we recognize revenue, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\nIn addition to the long-term trends and their financial effect on our business discussed in \"Trends in Our Business and Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024, fluctuations in our revenues have been and may continue to be affected by a combination of factors, including:\n•changes in foreign currency exchange rates;\n•changes in pricing, such as those resulting from changes in fee structures, discounts, and customer incentives;\n•general economic conditions and various external dynamics, including geopolitical events, regulations, and other measures and their effect on advertiser, consumer, and enterprise spending;\n•new product, service, and market launches; and\n•seasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), other sources (\"Google subscriptions, platforms, and devices\"), Google Cloud, and Other Bets have been, and may continue to be, affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google subscriptions, platforms, and devices revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following:\n•Google Search & other, which includes revenues generated on Google search properties (including revenues from traffic generated by search distribution partners who use Google.com as their default search in browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and Google Play;\n•YouTube ads, which includes revenues generated on YouTube properties; and\n•Google Network, which includes revenues generated on Google Network properties participating in AdMob, AdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our advertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while impressions and cost-per-impression pertain to traffic on our Google Network properties.\nPaid clicks represent engagement by users and include clicks on advertisements by end-users on Google search properties and other Google owned and operated properties including Gmail, Google Maps, and Google Play. Cost-per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the average amount we charge advertisers for each engagement by users.\nImpressions include impressions displayed to users on Google Network properties participating primarily in AdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based revenues divided by our total number of impressions, and represents the average amount we charge advertisers for each impression displayed to users.\nAs our business evolves, we periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues generated by the corresponding click and impression activity.\nFluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google Search & other properties and the change in impressions and cost-per-impression on Google Network properties and the correlation between these items have been, and may continue to be, affected by factors in addition to the general factors described above, such as:\n•advertiser competition for keywords;\n•changes in advertising quality, formats, delivery, or policy;\n•changes in device mix;\n•seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as traditional retail seasonality; and\n•traffic growth in emerging markets compared to more mature markets and across various verticals and channels.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues are comprised of the following:\n•consumer subscriptions, which primarily include revenues from YouTube services, such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as Google One;\n•platforms, which primarily include revenues from Google Play sales of apps and in-app purchases;\n•devices, which primarily include sales of the Pixel family of devices; and\n•other products and services.\nFluctuations in our Google subscriptions, platforms, and devices revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand, number of subscribers, and the timing of product launches.\nGoogle Cloud\nGoogle Cloud revenues are comprised of the following:\n•Google Cloud Platform, which generates consumption-based fees and subscriptions for infrastructure, platform, and other services. These services provide access to solutions such as AI offerings including our AI infrastructure, Vertex AI platform, and Gemini Enterprise: cybersecurity; and data and analytics;\n•Google Workspace, which includes subscriptions for cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet, with integrated features like Gemini for Google Workspace; and\n•other enterprise services.\nFluctuations in our Google Cloud revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand.\nOther Bets\nRevenues from Other Bets are generated primarily from the sale of autonomous transportation services, healthcare-related services, and internet services.\nCosts and Expenses\nOur cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Additionally, fluctuations in employee compensation expenses may not directly correlate with changes in headcount due to factors such as annual SBC awards that generally vest over four years.\nCost of Revenues\nCost of revenues is comprised of TAC and other costs of revenues.\n•TAC includes:\n◦amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and\n◦amounts paid to Google Network partners primarily for ads displayed on their properties.\n•Other cost of revenues primarily includes:\n◦content acquisition costs, which are payments to content providers from whom we license video and other content for distribution, primarily related to YouTube (we pay fees to these content providers based on revenues generated, subscriber counts, or a flat fee);\n◦depreciation expense related to our technical infrastructure;\n◦employee compensation expenses related to our technical infrastructure and other operations such as content review and customer and product support;\n◦inventory and other costs related to the devices we sell; and\n◦other technical infrastructure operations costs, including network capacity, energy, and equipment costs.\nTAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners.\nOperating Expenses\nOperating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative.\nThe main components of our R&D expenses are:\n•depreciation;\n•employee compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; and\n•third-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts.\nThe main components of our sales and marketing expenses are:\n•employee compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and\n•spend relating to our advertising and promotional activities in support of our products and services.\nThe main components of our general and administrative expenses are:\n•employee compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions;\n•expenses relating to legal and other matters, including certain fines and settlements; and\n•third-party services fees, including audit, consulting, outside legal, and other outsourced administrative services.\nOther Income (Expense), Net\nOI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments.\nFor additional information, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 and Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 as well as Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nProvision for Income Taxes\nProvision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties.\nFor additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 as well as Note 14 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nExecutive Overview\nThe following table summarizes consolidated financial results (in millions, except per share information and percentages):\n(1) See \"Use of Non-GAAP Constant Currency Information\" below for details relating to our use of constant currency information.\n(2) For additional information on the calculation of diluted EPS, see Note 12 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\n•Revenues were $102.3 billion, an increase of 16% year over year, primarily driven by an increase in Google Services revenues of $10.5 billion, or 14%, and an increase in Google Cloud revenues of $3.8 billion, or 34%.\n•Total constant currency revenues, which exclude the effect of hedging, increased 15% year over year.\n•Cost of revenues was $41.4 billion, an increase of 13% year over year, primarily driven by increases in content acquisition costs, TAC, depreciation expense, and other technical infrastructure operations costs.\n•Operating expenses were $29.7 billion, an increase of 28% year over year, primarily driven by increases in expenses related to legal and other matters, employee compensation expenses, and depreciation expense.\nOther Information:\n•On September 5, 2025, the EC announced its decision that Google had infringed European competition laws. The EC decision imposed a $3.5 billion fine which we accrued in general and administrative expenses in our Google Services segment for the three months ended September 30, 2025.\n•OI&E of $12.8 billion for the three months ended September 30, 2025 included net gains on equity securities of $10.7 billion, primarily related to unrealized gains on our non-marketable equity securities.\n•Changes to U.S. tax law enacted on July 4, 2025, allow, among other things, for immediate expensing of domestic research and experimentation costs and accelerated depreciation on eligible capital expenditures, the effects of which are included in operating cash flows for the three months ended September 30, 2025.\n•Repurchases of Class A and Class C shares were $926 million and $10.6 billion, respectively, totaling $11.6 billion for the three months ended September 30, 2025.\n•Operating cash flow was $48.4 billion for the three months ended September 30, 2025.\n•Capital expenditures, which primarily reflected investments in technical infrastructure, were $24.0 billion for the three months ended September 30, 2025.\n•As of September 30, 2025, we had 190,167 employees.\nWe are monitoring ongoing developments surrounding international trade and the macroeconomic environment. As a result of volatility in international trade and financial markets, we may experience direct and indirect effects on our business, operations, and financial results. Our past results may not be indicative of our future performance, and our financial results may differ materially from historical trends.\nFinancial Results\nRevenues\nThe following table presents revenues by type (in millions):\nGoogle Services\nGoogle advertising revenues\nGoogle Search & other\nGoogle Search & other revenues increased $7.2 billion and $17.4 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025. The overall growth was driven by interrelated factors including increases in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery.\nYouTube ads\nYouTube ads revenues increased $1.3 billion and $3.3 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025. The growth was driven by our direct response advertising products followed by our brand advertising products, both of which benefited from increased spending by our advertisers.\nGoogle Network\nGoogle Network revenues decreased $194 million from the three months ended September 30, 2024 to the three months ended September 30, 2025, primarily due to a decrease in AdSense, partially offset by an increase in AdMob revenues.\nGoogle Network revenues decreased $441 million from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily due to a decrease in AdSense and Google Ad Manager revenues.\nMonetization Metrics\nThe following table presents changes in monetization metrics for Google Search & other revenues (paid clicks and cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a percentage, from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025:\nChanges in paid clicks and impressions are driven by a number of interrelated factors, including changes in advertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search queries resulting from changes in user adoption and usage, primarily on mobile devices.\nChanges in cost-per-click and cost-per-impression are driven by a number of interrelated factors including changes in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix, property mix, and changes in foreign currency exchange rates.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues increased $2.2 billion and $5.7 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025. The growth was primarily driven by an increase in subscriptions revenues. This increase was primarily due to the contribution from growth in paid subscriptions across both YouTube services and Google One.\nGoogle Cloud\nGoogle Cloud revenues increased $3.8 billion and $9.8 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025 primarily driven by growth in Google Cloud Platform largely from infrastructure services.\nRevenues by Geography\nThe following table presents revenues by geography as a percentage of revenues, determined based on the addresses of our customers:\nFor additional information, see Note 2 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nUse of Non-GAAP Constant Currency Information\nInternational revenues, which represent a significant portion of our revenues, are generally transacted in multiple currencies and therefore are affected by fluctuations in foreign currency exchange rates.\nThe effect of currency exchange rates on our business is an important factor in understanding period-to-period comparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP percentage change in constant currency revenues (\"percentage change in constant currency revenues\") for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe the presentation of results on a constant currency basis in addition to GAAP results helps improve the ability to understand our performance, because it excludes the effects of foreign currency volatility that are not indicative of our core operating results.\nConstant currency information compares results between periods as if exchange rates had remained constant period over period. We define constant currency revenues as revenues excluding the effect of foreign currency exchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated level. We use constant currency revenues to determine the constant currency revenue percentage change on a year-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior year comparable period exchange rates, as well as excluding any hedging effects realized in the current period.\nConstant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods.\nThese results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP.\nThe following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages):\n(1)Total constant currency revenues of $101.2 billion for the three months ended September 30, 2025 increased $13.0 billion compared to $88.3 billion in revenues, excluding hedging effect, for the three months ended September 30, 2024.\nEMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the euro and British pound.\nAPAC revenue growth was not materially affected by changes in foreign currency exchange rates.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso.\n(1)Total constant currency revenues of $288.8 billion for the nine months ended September 30, 2025 increased $35.4 billion compared to $253.4 billion in revenues, excluding hedging effect, for the nine months ended September 30, 2024.\nEMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the euro and British pound, partially offset by the U.S. dollar strengthening relative to the Turkish lira.\nAPAC revenue growth was not materially affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Australian dollar and Indian rupee, partially offset by the U.S dollar weakening relative to the Japanese yen.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Brazilian real and Mexican peso.\nCosts and Expenses\nCost of Revenues\nThe following table presents cost of revenues, including TAC (in millions, except percentages):\nCost of revenues increased $4.9 billion from the three months ended September 30, 2024 to the three months ended September 30, 2025 due to an increase in other cost of revenues and TAC of $3.7 billion and $1.2 billion, respectively. Cost of revenues increased $11.1 billion from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 due to an increase in other cost of revenues and TAC of $7.8 billion and $3.3 billion, respectively.\nThe increase in TAC from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. The TAC rate decreased from 20.8% to 20.1% from the three months ended September 30, 2024 to the three months ended September 30, 2025 and decreased from 20.8% to 20.4% from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rates on Google Search & other and Google Network revenues were substantially consistent from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025.\nThe increase in other cost of revenues from the three months ended September 30, 2024 to the three months ended September 30, 2025 was primarily due to increases in content acquisition costs, largely for YouTube, depreciation expense, other technical infrastructure operations costs, and devices costs.\nThe increase in other cost of revenues from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 was primarily due to increases in content acquisition costs, largely for YouTube, depreciation expense, and other technical infrastructure operations costs.\nResearch and Development\nThe following table presents R&D expenses (in millions, except percentages):\nR&D expenses increased $2.7 billion from the three months ended September 30, 2024 to the three months ended September 30, 2025, primarily driven by increases in employee compensation expenses of $1.5 billion, depreciation expense of $659 million, and other technical infrastructure operations costs of $407 million.\nR&D expenses increased $6.3 billion from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily driven by increases in employee compensation expenses of $3.0 billion and depreciation expense of $1.7 billion.\nSales and Marketing\nThe following table presents sales and marketing expenses (in millions, except percentages):\nSales and marketing expenses decreased $22 million from the three months ended September 30, 2024 to the three months ended September 30, 2025, due to a combination of factors, none of which were individually significant.\nSales and marketing expenses increased $33 million from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily driven by an increase in advertising and promotional activities of $550 million, partially offset by a decrease in employee compensation expenses of $369 million.\nGeneral and Administrative\nThe following table presents general and administrative expenses (in millions, except percentages):\nGeneral and administrative expenses increased $3.8 billion from the three months ended September 30, 2024 to the three months ended September 30, 2025, primarily driven by an increase in expenses related to legal and other matters of $3.8 billion, largely the result of the $3.5 billion EC fine.\nGeneral and administrative expenses increased $6.4 billion from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily driven by an increase in expenses related to legal and other matters of $6.3 billion, largely the result of the $3.5 billion EC fine accrued in the third quarter of 2025 and a $1.4 billion legal accrual made in the second quarter of 2025.\nSegment Profitability\nWe report our segment results as Google Services, Google Cloud, and Other Bets. Additionally, certain costs are not allocated to our segments because they represent Alphabet-level activities. For further details on our segments, see Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nThe following table presents segment operating income (loss) (in millions):\n(1)In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $17 million and $(207) million for the three months ended September 30, 2024 and 2025, respectively, and $191 million and $(60) million for the nine months ended September 30, 2024 and 2025, respectively. Alphabet-level activities include charges related to employee severance and office space charges.\nGoogle Services\nGoogle Services operating income increased $2.7 billion and $10.8 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025, respectively. The increase in operating income was primarily driven by an increase in revenues, partially offset by an increase in expenses related to legal and other matters, content acquisition costs, and TAC.\nGoogle Cloud\nGoogle Cloud operating income increased $1.6 billion and $4.6 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025, respectively. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in usage costs for technical infrastructure and employee compensation expenses.\nOther Bets\nOther Bets operating loss increased $310 million and $628 million from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025, respectively. The increase in operating loss was due to a combination of factors, none of which were individually significant.\nOther Income (Expense), Net\nThe following table presents OI&E (in millions):\nOI&E, net increased $9.6 billion and $20.5 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025, respectively. The increase was primarily due to increases in net unrealized gains on equity securities resulting from fair value adjustments on non-marketable equity securities.\nFor additional information, see Note 3 and Note 7 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nProvision for Income Taxes\nThe following table presents provision for income taxes (in millions, except effective tax rate):\nThe effective tax rate increased from the three months ended September 30, 2024 to the three months ended September 30, 2025. This increase was primarily due to a decrease in the U.S. Federal Foreign Derived Intangible Income tax deduction, and a non-deductible EC fine, partially offset by changes in prior period tax positions.\nThe effective tax rate increased from the nine months ended September 30, 2024 to the nine months ended September 30, 2025. This increase was primarily due to a decrease in the U.S. Federal Foreign Derived Intangible\nIncome tax deduction, a non-deductible EC fine and legal settlement in the U.S., a decrease in SBC-related tax benefits, partially offset by changes in prior period tax positions.\nChanges to U.S. tax law enacted on July 4, 2025, allow for immediate expensing of domestic research and experimentation costs, accelerated depreciation on eligible capital expenditures, and other tax law changes impacting 2025 with certain changes effective in 2026. These changes are reflected in our results for the three and nine months ended September 30, 2025.\nThe Organization for Economic Cooperation and Development (OECD) is coordinating negotiations among more than 140 countries with the goal of achieving consensus around substantial changes to international tax policies, including the implementation of a minimum global effective tax rate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect others to follow, however this did not have a material effect on our income tax provision for the period ending September 30, 2025.\nFinancial Condition\nCash, Cash Equivalents, and Marketable Securities\nAs of September 30, 2025, we had $98.5 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities.\nSources, Uses of Cash and Related Trends\nOur principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders.\nThe following table presents cash flows (in millions):\nCash Provided by Operating Activities\nOur largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash through consumer subscriptions, the sale of apps and in-app purchases, and devices. In Google Cloud, we generate cash through consumption-based fees and subscriptions for infrastructure, platform, applications, and other cloud services.\nOur primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for devices, to tax authorities for income taxes, and other general corporate expenditures.\nNet cash provided by operating activities increased from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 due to an increase in cash received from customers, partially offset by an increase in cash payments for cost of revenues and operating expenses.\nCash Used in Investing Activities\nCash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions.\nNet cash used in investing activities increased from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 primarily due to an increase in purchases of property and equipment, driven by investments in technical infrastructure, and a decrease in maturities and sales of marketable securities.\nCash Used in Financing Activities\nCash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, payment of dividends, and repayments of debt.\nNet cash used in financing activities decreased from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 due to an increase in proceeds from issuance of debt, net of repayments.\nLiquidity and Material Cash Requirements\nWe expect existing cash, cash equivalents, short-term marketable securities, and cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months, and thereafter for the foreseeable future.\nCapital Expenditures and Leases\nWe make investments in land, buildings, and servers and network equipment through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products.\nCapital Expenditures\nOur capital investments in property and equipment consist primarily of the following major categories:\n•technical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, and data center land and building construction; and\n•office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\").\nAssets not yet in service are those that are not ready for our intended use, including assets in the process of construction or assembly, and consists primarily of technical infrastructure. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct buildings, and secure and install servers and network equipment.\nDuring the nine months ended September 30, 2024 and 2025, we spent $38.3 billion and $63.6 billion on capital expenditures, respectively. We expect full year 2025 capital expenditures to exceed full year 2024. In 2026, we expect to significantly increase, relative to 2025, our investment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products and services. Depreciation of our property and equipment commences when such assets are ready for our intended use. For the nine months ended September 30, 2024 and 2025, depreciation on property and equipment was $11.1 billion and $15.1 billion, respectively.\nLeases\nAs of September 30, 2025, the amount of total future lease payments under operating and finance leases was $17.5 billion and $2.9 billion, respectively.\nAs of September 30, 2025, we have entered into leases primarily related to data centers that have not yet commenced with future lease payments of $42.6 billion, including a purchase option considered reasonably certain to be exercised. These leases will commence between 2025 and 2031 with non-cancelable lease terms between one and 25 years.\nFor additional information on leases, see Note 4 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nFinancing\nWe have a short-term debt financing program of up to $25.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. As of September 30, 2025, we had $3.0 billion of short-term commercial paper outstanding.\nIn May 2025, we issued $5.0 billion of U.S. dollar-denominated fixed-rate senior unsecured notes in four tranches: $750 million of 4.00% notes due 2030, $1.25 billion of 4.50% notes due 2035, $1.5 billion of 5.25% notes due 2055, and $1.5 billion of 5.30% notes due 2065. Additionally in May 2025, we issued €6.75 billion of euro-denominated fixed-rate senior unsecured notes in five tranches: €1.5 billion of 2.50% notes due 2029, €1.5 billion of 3.00% notes due 2033, €1.25 billion of 3.38% notes due 2037, €1.25 billion of 3.88% notes due 2045, and\n€1.25 billion of 4.00% notes due 2054. The net proceeds from all notes issued in May 2025 are used for general corporate purposes.\nAs of September 30, 2025, we had senior unsecured notes outstanding with a total carrying value of $23.6 billion.\nAs of September 30, 2025, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2026 and $6.0 billion expiring in April 2030. The interest rates for all credit facilities are determined based on a formula using certain market rates. No amounts have been borrowed under the credit facilities.\nFor additional information, see Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nWe primarily utilize contract manufacturers for the assembly of our servers used in our technical infrastructure and devices we sell. We have agreements where we may purchase components directly from suppliers and then supply these components to contract manufacturers for use in the assembly of the servers and devices. Certain of these arrangements result in a portion of the cash received from and paid to the contract manufacturers to be presented as financing activities in the Consolidated Statements of Cash Flows included in Item 1 of this Quarterly Report on Form 10-Q.\nShare Repurchase Program\nIn the three and nine months ended September 30, 2025, we repurchased and subsequently retired 56 million and 220 million shares for $11.6 billion and $40.1 billion, respectively.\nIn April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its Class A and Class C shares. In April 2025, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of Class A and Class C shares. As of September 30, 2025, $74.8 billion remained available for Class A and Class C share repurchases.\nThe following table presents Class A and Class C shares repurchased and subsequently retired (in millions):\n(1)Shares repurchased include unsettled repurchases.\nFor additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nDividend Program\nIn the three and nine months ended September 30, 2025, total cash dividends were $1.2 billion and $3.6 billion for Class A, $177 million and $527 million for Class B, and $1.1 billion and $3.4 billion for Class C shares, respectively.\nIn April 2025, the Board of Directors of Alphabet increased the quarterly cash dividend by 5% to $0.21 per share of outstanding Class A, Class B, and Class C shares.\nThe company has declared a quarterly cash dividend in the current quarter, and intends to pay quarterly cash dividends in the future, subject to review and approval by the company’s Board of Directors in its sole discretion.\nEuropean Commission Fines\nIn 2018 and 2019, the EC announced decisions that certain actions taken by Google infringed European competition law and imposed fines of €4.3 billion ($5.1 billion as of June 30, 2018) and €1.5 billion ($1.7 billion as of March 20, 2019), respectively.\nIn September 2022, the General Court affirmed the EC decision but reduced the 2018 fine from €4.3 billion to €4.1 billion. We subsequently appealed the General Court's affirmation of the EC decision with the European Court of Justice, which remains pending.\nIn September 2024, the EU's General Court overturned the 2019 decision and annulled the €1.5 billion fine. The EC has appealed the General Court's decision to the European Court of Justice.\nIn September 2025, the EC announced its decision that Google had infringed European competition laws through “self-preferencing” practices on the buy-side and the sell-side relating to its advertising technology. The EC imposed a €3.0 billion fine ($3.5 billion as of September 5, 2025), which was accrued in the third quarter of 2025.\nWe included the outstanding EC fines, including any under appeal, in accrued expenses and other current liabilities on our Consolidated Balance Sheets. For additional information, see Note 10 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nTaxes\nAs of September 30, 2025, we had long-term income taxes payable of $10.1 billion primarily related to uncertain tax positions.\nPurchase Commitments and Other Contractual Obligations\nWe have material purchase commitments and other contractual obligations primarily related to energy contracts, licenses (including content licenses), and technical infrastructure and inventory orders. As of September 30, 2025, the total for these commitments was $93.7 billion, of which $72.5 billion was short-term, mostly related to technical infrastructure and inventory orders. These amounts reflect commitments and obligations through open purchase orders as well as the non-cancelable portion or the minimum cancellation fee in certain agreements. For those agreements with variable terms, we do not estimate the non-cancelable obligation beyond any minimum quantities and/or pricing as of September 30, 2025. In certain instances, the amount of our contractual obligations may change based on the expected timing of order fulfillment from our suppliers. For more information related to our content licenses, see Note 10 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nIn addition, we regularly enter into multi-year, non-cancellable agreements to purchase renewable energy and energy attributes, such as renewable energy certificates. These agreements do not include a minimum dollar commitment. The amounts to be paid under these agreements are based on the actual volumes to be generated and are not readily determinable.\nWe may experience increases in the costs associated with our purchase commitments and other contractual obligations as a result of ongoing developments surrounding international trade. For details on risks related to our manufacturing and supply chain and other risks, refer to Part I, Item 1A, \"Risk Factors\" in our Annual Report on Form 10-K for the fiscal year ending December 31, 2024.\nPending Acquisition\nIn March 2025, we entered into a definitive agreement to acquire Wiz, a leading cloud security platform, for $32.0 billion, subject to closing adjustments, in an all-cash transaction. The acquisition of Wiz is expected to close in 2026, subject to customary closing conditions, including the receipt of regulatory approvals. For additional information, see Note 8 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nCritical Accounting Estimates\nSee Part II, Item 7, \"Critical Accounting Estimates\" in our Annual Report on Form 10-K for the year ended December 31, 2024.\nAvailable Information\nOur website is located at www.abc.xyz, and our investor relations website is located at www.abc.xyz/investor. Access to our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and our Proxy Statements, and any amendments to these reports, is available on our investor relations website, free of charge, after we file or furnish them with the SEC and they are available on the SEC's website at www.sec.gov.\nWe webcast via our investor relations YouTube channel and website our earnings calls and certain events we participate in or host with members of the investment community. Our investor relations website also provides notifications of news or announcements regarding our financial performance and other items that may be material or of interest to our investors, including SEC filings, investor events, press and earnings releases, and blogs. We also share Google news and product updates on Google’s Keyword blog at https://www.blog.google/ and News From Google page on X at x.com/NewsFromGoogle, and our executive officers may also use certain social media channels, such as X and LinkedIn, to communicate information about earnings results and company updates, which\nmay be of interest or material to our investors. Further, corporate governance information, including our certificate of incorporation, bylaws, governance guidelines, board committee charters, and code of conduct, is also available on our investor relations website under the heading \"Governance.\" The information contained on, or that may be accessed through our websites or our executive officers' social media channels, is not incorporated by reference into this Quarterly Report on Form 10-Q or in any other report or document we file with the SEC, and any references to our websites are intended to be inactive textual references only.\nITEM 3.QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nFor quantitative and qualitative disclosures about market risk, refer to Part II, Item 7A, \"Quantitative and Qualitative Disclosures About Market Risk\" in our Annual Report on Form 10-K for the year ended December 31, 2024.\nITEM 4.CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our chief executive officer and chief financial officer, evaluated the effectiveness of our disclosure controls and procedures pursuant to Rule 13a-15 under the Exchange Act, as of the end of the period covered by this Quarterly Report on Form 10-Q.\nBased on this evaluation, our chief executive officer and chief financial officer concluded that, as of September 30, 2025, our disclosure controls and procedures are designed at a reasonable assurance level and are effective to provide reasonable assurance that information we are required to disclose in reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to our management, including our chief executive officer and chief financial officer, as appropriate, to allow timely decisions regarding required disclosure.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal control over financial reporting that occurred during the quarter ended September 30, 2025 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nLimitations on Effectiveness of Controls and Procedures\nIn designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives. In addition, the design of disclosure controls and procedures must reflect the fact that there are resource constraints and that management is required to apply its judgment in evaluating the benefits of possible controls and procedures relative to their costs.",
    "part_1_item_1": "ITEM 1.FINANCIAL STATEMENTS\nAlphabet Inc.\nCONSOLIDATED BALANCE SHEETS\n(in millions, except par value per share amounts)\nSee accompanying notes.\nAlphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF INCOME\n(in millions, except per share amounts; unaudited)\nSee accompanying notes.\nAlphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in millions; unaudited)\nSee accompanying notes.\nAlphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(in millions; unaudited)\nAlphabet Inc.\nSee accompanying notes.\nAlphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions; unaudited)\nSee accompanying notes.\nAlphabet Inc.\nAlphabet Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nNote 1. Summary of Significant Accounting Policies\nNature of Operations\nGoogle was incorporated in California in September 1998 and re-incorporated in the State of Delaware in August 2003. In 2015, we implemented a holding company reorganization, and as a result, Alphabet Inc. (\"Alphabet\") became the successor issuer to Google.\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices.\nBasis of Consolidation\nThe consolidated financial statements of Alphabet include the accounts of Alphabet and entities consolidated under the variable interest and voting models. Intercompany balances and transactions have been eliminated.\nUnaudited Interim Financial Information\nThese unaudited interim consolidated financial statements have been prepared in accordance with generally accepted accounting principles in the United States (GAAP), and in our opinion, include all adjustments of a normal recurring nature necessary for fair financial statement presentation. Interim results are not necessarily indicative of the results to be expected for the full year ending December 31, 2025. We have made estimates and assumptions that affect the amounts reported and disclosed in the financial statements and the accompanying notes. Actual results could differ materially from these estimates.\nThese consolidated financial statements and other information presented in this Form 10-Q should be read in conjunction with the consolidated financial statements and the related notes included in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 filed with the SEC.\nRecently Issued Accounting Pronouncements Not Yet Adopted\nIn December 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-09 \"Income Taxes (Topics 740): Improvements to Income Tax Disclosures\" to expand the disclosure requirements for income taxes. Upon adoption, we will be required to disclose additional specified categories in the rate reconciliation in both percentage and dollar amounts. We will also be required to disclose the amount of income taxes paid disaggregated by jurisdiction, among other disclosure requirements. The standard, which is effective for our 2025 annual period, will be applied retrospectively.\nIn November 2024, the FASB issued ASU 2024-03 \"Income Statement: Reporting Comprehensive Income-Expense Disaggregation Disclosures (Subtopic 220-40)\" to improve the disclosures about an entity’s expenses. Upon adoption, we will be required to disclose in the notes to the financial statements a disaggregation of certain expense categories included within the expense captions on the face of the income statement. The standard is effective for our 2027 annual period, and our interim periods beginning in 2028, with early adoption permitted. The standard can be applied either prospectively or retrospectively. We are currently assessing adoption timing and the effect that the updated standard will have on our financial statement disclosures.\nIn September 2025, the FASB issued ASU 2025-06 \"Intangibles: Goodwill and Other-Internal-Use Software (Subtopic 350-40): Targeted Improvements to the Accounting for Internal-Use Software\" to modernize the accounting for software costs under Subtopic 350-40, Intangibles-Goodwill and Other-Internal-Use Software (referred to as “internal-use software”). Upon adoption, we will be required to account for internal-use software under the updated capitalization criteria. The standard is effective for our interim and annual 2028 periods, with early adoption permitted. The standard can be applied either prospectively, retrospectively, or under a modified transition approach. We are currently assessing adoption timing and the method of adoption.\nPrior Period Reclassifications\nCertain amounts in prior periods have been reclassified to conform with current period presentation.\nAlphabet Inc.\nNote 2. Revenues\nDisaggregated Revenues\nThe following table presents revenues disaggregated by type (in millions):\nThe following table presents revenues disaggregated by geography, based on the addresses of our customers (in millions):\n(1) Regions represent Europe, the Middle East, and Africa (EMEA); Asia-Pacific (APAC); and Canada and Latin America (\"Other Americas\").\nRevenue Backlog\nAs of September 30, 2025, we had $157.7 billion of remaining performance obligations (“revenue backlog”), primarily related to Google Cloud. Revenue backlog represents commitments in customer contracts that have not yet been recognized as revenue. We expect to recognize just over 55% of the revenue backlog as revenues over the next 24 months with the remainder to be recognized thereafter. The estimated revenue backlog and timing of revenue recognition for these commitments is largely driven by our ability to deliver in accordance with relevant contract terms and when our customers utilize services. Revenue backlog includes related deferred revenue currently recorded as well as amounts that will be invoiced in future periods, and excludes contracts with an original expected term of one year or less and cancellable contracts.\nDeferred Revenues\nWe record deferred revenues when cash payments are received or due in advance of our performance, including amounts which are refundable. Deferred revenues primarily relate to Google Cloud and Google subscriptions, platforms, and devices. Total deferred revenue as of December 31, 2024 was $6.0 billion, of which $4.1 billion was recognized as revenues for the nine months ended September 30, 2025. Total deferred revenue as of September 30, 2025 was $7.4 billion.\nNote 3. Financial Instruments\nFair Value Measurements\nInvestments Measured at Fair Value on a Recurring Basis\nCash, cash equivalents, and marketable equity securities are measured at fair value and classified within\nAlphabet Inc.\nLevel 1 and Level 2 in the fair value hierarchy, because we use quoted prices for identical assets in active markets or inputs that are based upon quoted prices for similar instruments in active markets.\nDebt securities are measured at fair value and classified within Level 2 in the fair value hierarchy, because we use quoted market prices to the extent available or alternative pricing sources and models utilizing market observable inputs to determine fair value. For certain marketable debt securities, we have elected the fair value option for which changes in fair value are recorded in OI&E. The fair value option was elected for these securities to align with the unrealized gains and losses from related derivative contracts.\nThe following tables summarize our cash, cash equivalents, and marketable securities measured at fair value on a recurring basis (in millions):\n(1)Represents gross unrealized gains and losses for debt securities recorded to accumulated other comprehensive income (AOCI).\n(2)The long-term portion of marketable equity securities (subject to long-term lock-up restrictions) of $266 million as of December 31, 2024 is included within other non-current assets.\nAlphabet Inc.\n(1)Represents gross unrealized gains and losses for debt securities recorded to AOCI.\nInvestments Measured at Fair Value on a Nonrecurring Basis\nOur non-marketable equity securities are investments in privately held companies without readily determinable market values. The carrying value of our non-marketable equity securities is adjusted to fair value upon observable transactions for identical or similar investments of the same issuer or impairment. Non-marketable equity securities that have been remeasured during the period based on observable transactions are classified within Level 2 or Level 3 in the fair value hierarchy. Non-marketable equity securities that have been remeasured due to impairment are classified within Level 3. Our valuation methods include option pricing models, market comparable approach, and common stock equivalent method, which may include a combination of the observable transaction price at the transaction date and other unobservable inputs including volatility, expected time to exit, risk free rate, and the rights, and obligations of the securities we hold. These inputs vary significantly based on investment type.\nAs of September 30, 2025, the carrying value of our non-marketable equity securities was $61.1 billion, of which $38.9 billion was remeasured at fair value during the three months ended September 30, 2025 and was primarily classified within Level 2 of the fair value hierarchy at the time of measurement.\nAlphabet Inc.\nDebt Securities\nThe following table summarizes the estimated fair value of investments in available-for-sale marketable debt securities by effective contractual maturity dates (in millions):\nThe following tables present fair values and gross unrealized losses recorded to AOCI, aggregated by investment category and the length of time that individual securities have been in a continuous loss position (in millions):\nWe determine realized gains or losses on the sale or extinguishment of debt securities on a specific identification method. The following table summarizes gains and losses for debt securities, reflected as a component of OI&E (in millions):\nEquity Investments\nThe carrying value of equity securities is measured as the total initial cost plus the cumulative net gain (loss). Gains and losses, including impairments, are included as a component of OI&E in the Consolidated Statements of Income. See Note 7 for further details on OI&E. Certain of our non-marketable equity securities include our investments in variable interest entities (VIEs) where we are not the primary beneficiary. See Note 5 for further details on VIEs.\nAlphabet Inc.\nThe carrying values for marketable and non-marketable equity securities are summarized below (in millions):\n(1)Non-marketable equity securities cumulative net gain (loss) is comprised of $22.7 billion and $42.9 billion of gains and $8.4 billion and $8.9 billion of losses (including impairments) as of December 31, 2024 and September 30, 2025, respectively.\nGains and Losses on Marketable and Non-marketable Equity Securities\nGains and losses (including impairments), net, for marketable and non-marketable equity securities included in OI&E are summarized below (in millions):\n(1)Unrealized gain (loss) on non-marketable equity securities accounted for under the measurement alternative is comprised of $1.9 billion and $10.6 billion of upward adjustments and $412 million and $346 million of downward adjustments (including impairments) for the three months ended September 30, 2024 and 2025, respectively, and $5.0 billion and $20.9 billion of upward adjustments and $2.0 billion and $1.2 billion of downward adjustments (including impairments) for the nine months ended September 30, 2024 and 2025, respectively.\nIn the table above, realized net gain (loss) on equity securities sold during the period reflects the difference between the sale proceeds and the carrying value of the equity securities at the beginning of the period or the purchase date, if later.\nCumulative net gains (losses) on equity securities sold during the period, which is summarized in the following table (in millions), represents the total net gains (losses) recognized after the initial purchase date of the equity security sold during the period. While these net gains (losses) may have been reflected in periods prior to the period of sale, we believe they are important supplemental information as they reflect the economic net gains (losses) on the securities sold during the period. Cumulative net gains (losses) are calculated as the difference between the sale price and the initial purchase price for the equity security sold during the period.\nEquity Securities Accounted for Under the Equity Method\nAs of December 31, 2024 and September 30, 2025, equity securities accounted for under the equity method had a carrying value of approximately $2.0 billion and $2.3 billion, respectively. Our share of gains and losses, including impairments, are included as a component of OI&E, in the Consolidated Statements of Income. See Note 7 for further details on OI&E. Certain of our equity method securities include our investments in VIEs where we are not the primary beneficiary. See Note 5 for further details on VIEs.\nConvertible Notes\nAlphabet Inc.\nAs of December 31, 2024 and September 30, 2025, we had investments in convertible notes of $2.9 billion and $1.3 billion, respectively. During the nine months ended September 30, 2025, we made additional investments in convertible notes totaling $1.1 billion and converted $3.0 billion of our convertible notes into equity securities, which included gains from conversion of $418 million. These gains were recognized in OI&E within the Consolidated Statement of Income. See Note 7 for further details on OI&E.\nDerivative Financial Instruments\nWe primarily use derivative instruments to manage risks relating to our ongoing business operations. The primary risk managed is foreign exchange risk. We use foreign currency contracts to reduce the risk that our cash flows, earnings, and investment in foreign subsidiaries will be adversely affected by foreign currency exchange rate fluctuations. We also enter into derivative instruments to partially offset our exposure to other risks and enhance investment returns.\nWe recognize derivative instruments in the Consolidated Balance Sheets at fair value and classify the derivatives primarily within Level 2 in the fair value hierarchy. We present our collar contracts (an option strategy comprised of a combination of purchased and written options) at net fair values and present all other derivatives at gross fair values. The accounting treatment for derivatives is based on the intended use and hedge designation.\nCash Flow Hedges\nWe designate foreign currency forward and option contracts (including collars) as cash flow hedges to hedge certain forecasted revenue transactions denominated in currencies other than the United States (U.S.) dollar. These contracts have maturities of 24 months or less.\nCash flow hedge amounts included in the assessment of hedge effectiveness are deferred in AOCI and subsequently reclassified to revenue when the hedged item is recognized in earnings. We exclude forward points and time value from our assessment of hedge effectiveness and amortize them on a straight-line basis over the life of the hedging instrument in revenues. The difference between fair value changes of the excluded component and the amount amortized to revenues is recorded in AOCI.\nAs of September 30, 2025, the net accumulated loss on our foreign currency cash flow hedges before tax effect was $257 million, which is expected to be reclassified from AOCI into revenues within the next 12 months.\nFair Value Hedges\nWe designate foreign currency forward contracts as fair value hedges to hedge foreign currency risks for our marketable securities denominated in currencies other than the U.S. dollar. Fair value hedge amounts included in the assessment of hedge effectiveness are recognized in OI&E, along with the offsetting gains and losses of the related hedged items. We exclude forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in OI&E.\nNet Investment Hedges\nWe designate foreign currency forward contracts, option contracts (including collars), and foreign currency-denominated debt as net investment hedges to hedge the foreign currency risks related to our investment in foreign subsidiaries. Net investment hedge amounts included in the assessment of hedge effectiveness are recognized in AOCI along with the foreign currency translation adjustment. For derivative instruments, we exclude forward points and time value from the assessment of hedge effectiveness and recognize changes in the excluded component in OI&E.\nWe had no foreign currency-denominated debt as of December 31, 2024 and $7.8 billion carrying value of foreign currency-denominated debt designated as net investment hedges as of September 30, 2025.\nOther Derivatives\nWe enter into foreign currency forward and option contracts that are not designated as hedging instruments to hedge intercompany transactions and other monetary assets or liabilities denominated in currencies other than the functional currency of a subsidiary. Gains and losses on these derivatives that are not designated as accounting hedges are primarily recorded in OI&E along with the foreign currency gains and losses on monetary assets and liabilities.\nWe also use derivatives not designated as hedging instruments to manage risks relating to interest rates, commodity prices, credit exposures, the market price of certain marketable equity securities, and to enhance investment returns. Additionally, we have credit derivative instruments resulting from agreements with third parties\nto backstop certain obligations relating to data center leases. Gains and losses arising from other derivatives are primarily reflected within the “other” component of OI&E. See Note 7 for further details.\nThe gross notional amounts of outstanding derivative instruments were as follows (in millions):\n(1) Notional amounts for credit derivatives are the backstop obligations related to certain third party data center leases and represent the maximum potential amount of future payments that could be required in the event of certain default scenarios, upon which we may receive equity in or cash payments from certain counterparties. See Note 5 for further details.\nThe fair values of outstanding derivative instruments were as follows (in millions):\n(1) Derivative assets are recorded as other current and non-current assets in the Consolidated Balance Sheets.\n(2) Derivative liabilities are recorded as accrued expenses and other liabilities, current and non-current in the Consolidated Balance Sheets.\nThe gains (losses) on derivatives and non-derivative financial instruments in cash flow hedging and net investment hedging relationships recognized in other comprehensive income (OCI) are summarized below (in millions):\nThe table below presents the gains (losses) of derivatives included in the Consolidated Statements of Income: (in millions):\nOffsetting of Derivatives\nWe enter into master netting arrangements and collateral security arrangements to reduce credit risk. Cash collateral received related to derivative instruments under our collateral security arrangements are included in other current assets with a corresponding liability. Cash and non-cash collateral pledged related to derivative instruments under our collateral security arrangements are included in other current assets.\nThe gross amounts of derivative instruments subject to master netting arrangements with various counterparties, and cash and non-cash collateral received and pledged under such agreements were as follows (in millions):\n(1)The balances as of December 31, 2024 and September 30, 2025 were related to derivatives allowed to be net settled in accordance with our master netting agreements.\nNote 4. Leases\nWe have entered into operating and finance lease agreements primarily for data centers, land, and offices throughout the world with varying lease terms.\nComponents of lease costs were as follows (in millions):\nSupplemental information related to leases was as follows (in millions):\nSupplemental cash flow information related to leases was as follows (in millions):\n(1)Financing cash flows used for financing leases are included within financing activities of the Consolidated Statements of Cash Flows as repayments of debt.\nFuture lease payments as of September 30, 2025 were as follows (in millions):\nAs of September 30, 2025, we have entered into leases primarily related to data centers that have not yet commenced with future lease payments of $42.6 billion, including a purchase option considered reasonably certain to be exercised, that are not yet recorded on our Consolidated Balance Sheet. These leases will commence between 2025 and 2031 with non-cancelable lease terms between one and 25 years.\nNote 5. Variable Interest Entities\nConsolidated VIEs\nWe consolidate VIEs in which we hold a variable interest and are the primary beneficiary. The results of operations and financial position of these VIEs are included in our consolidated financial statements.\nFor certain consolidated VIEs, their assets are not available to us, and their creditors do not have recourse to us. As of December 31, 2024 and September 30, 2025, assets that can only be used to settle obligations of these VIEs were $8.7 billion and $6.2 billion, respectively, and are primarily included in cash and cash equivalents on our Consolidated Balance Sheets. As of December 31, 2024 and September 30, 2025, liabilities for which creditors only have recourse to the VIEs were $2.3 billion and $1.8 billion, respectively. We may continue to fund ongoing operations of certain VIEs that are included within Other Bets.\nTotal noncontrolling interests (NCI) in our consolidated subsidiaries were $4.2 billion and $3.9 billion as of December 31, 2024 and September 30, 2025, respectively, of which $1.1 billion and $853 million were redeemable noncontrolling interests (RNCI) as of December 31, 2024 and September 30, 2025, respectively. NCI and RNCI are included within additional paid-in capital. Net loss attributable to noncontrolling interests was not material for any period presented and is included within the \"other\" component of OI&E. See Note 7 for further details on OI&E.\nUnconsolidated VIEs\nWe have interests in VIEs in which we are not the primary beneficiary. These VIEs include private companies that are primarily early stage companies, certain renewable energy entities in which activities involve power generation using renewable sources, and certain data center leasing entities.\nWe have determined that the governance structures of these entities do not allow us to direct the activities that would significantly affect their economic performance. Therefore, we are not the primary beneficiary, and the results of operations and financial position of these VIEs are not included in our consolidated financial statements.\nWe primarily account for our investments in private companies and renewable energy entities as non-marketable equity securities or equity method investments, which are included within non-marketable securities on our Consolidated Balance Sheets. The maximum exposure of these unconsolidated VIEs is generally based on the current carrying value of the investments and any future funding commitments. As of December 31, 2024 and September 30, 2025, our future funding commitments related to unconsolidated VIE investments were $1.5 billion and $860 million, respectively.\nWe account for our variable interests in certain data center leasing entities, which are in the form of credit backstop agreements as credit derivatives. The fair value of the credit derivatives are not material as of September 30, 2025. Our maximum exposure to loss for these unconsolidated VIEs is limited to our financial risk under certain default scenarios over remaining agreement periods of up to 10 years, to either pay a termination fee or assume the lease. As of September 30, 2025, the maximum exposure to loss is $6.5 billion. See Note 3 for further details on derivatives.\nNote 6. Debt\nShort-Term Debt\nWe have a short-term debt financing program of up to $25.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. We had $2.3 billion and $3.0 billion of commercial paper outstanding as of December 31, 2024 and September 30, 2025, respectively, with a weighted-average effective interest rate of 4.4% and 4.1%, respectively. The estimated fair value of the commercial paper approximated its carrying value as of December 31, 2024 and September 30, 2025.\nOur short-term debt balance also includes the current portion of certain long-term debt.\nLong-Term Debt\nIn May 2025, we issued $5.0 billion of U.S. dollar-denominated fixed-rate senior unsecured notes in four tranches: $750 million of 4.00% notes due 2030, $1.25 billion of 4.50% notes due 2035, $1.5 billion of 5.25% notes due 2055, and $1.5 billion of 5.30% notes due 2065. Additionally in May 2025, we issued €6.75 billion of euro-denominated fixed-rate senior unsecured notes in five tranches: €1.5 billion of 2.50% notes due 2029, €1.5 billion of 3.00% notes due 2033, €1.25 billion of 3.38% notes due 2037, €1.25 billion of 3.88% notes due 2045, and €1.25 billion of 4.00% notes due 2054. The net proceeds from all notes issued in May 2025 are used for general corporate purposes.\nTotal outstanding long-term debt is summarized below (in millions, except percentages):\n(1)Principal, unamortized discount, and debt issuance costs for the euro-denominated notes include the effect of foreign exchange rates.\n(2)Total current portion of long-term debt is included within accrued expenses and other current liabilities. See Note 7 for further details.\nThe notes in the table above are fixed-rate senior unsecured obligations and rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually, except for the euro-denominated notes, which are payable annually.\nThe total estimated fair value of the outstanding notes was approximately $9.0 billion and $21.1 billion as of December 31, 2024 and September 30, 2025, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy.\nCredit Facility\nAs of September 30, 2025, we had $10.0 billion of revolving credit facilities, of which $4.0 billion expires in April 2026 and $6.0 billion expires in April 2030. The interest rates for all credit facilities are determined based on a formula using certain market rates. No amounts were outstanding under the credit facilities as of December 31, 2024 and September 30, 2025.\nNote 7. Supplemental Financial Statement Information\nAccounts Receivable\nThe allowance for credit losses on accounts receivable was $879 million and $918 million as of December 31, 2024 and September 30, 2025, respectively.\nProperty and Equipment, Net\nProperty and equipment, net, consisted of the following (in millions):\n(1) As of December 31, 2024 and September 30, 2025, approximately 60% of technical infrastructure assets were comprised of servers and network equipment. The remaining balance was comprised of data center land and buildings and related assets.\nAccrued Expenses and Other Current Liabilities\nAccrued expenses and other current liabilities consisted of the following (in millions):\n(1) Additional property and equipment purchases of $3.2 billion and $5.7 billion as of December 31, 2024 and September 30, 2025, respectively, were included in accounts payable.\n(2) The amounts related to the European Commission (EC) fines, including any under appeal, are included in accrued expenses and other current liabilities on our Consolidated Balance Sheets. Amounts include the effects of foreign exchange and interest. See Note 10 for further details.\n(3) As of September 30, 2025, other accrued expenses and current liabilities included a $1.4 billion accrual for settlement of certain privacy matters. See Note 10 for further details.\nAccumulated Other Comprehensive Income (Loss)\nComponents of AOCI, net of income tax, were as follows (in millions):\nThe effects on net income of amounts reclassified from AOCI were as follows (in millions):\nOther Income (Expense), Net\nComponents of OI&E were as follows (in millions):\n(1)Interest expense is net of interest capitalized of $57 million and $130 million for the three months ended September 30, 2024 and 2025, respectively, and $143 million and $301 million for the nine months ended September 30, 2024 and 2025, respectively.\nNote 8. Acquisitions\nPending Acquisition\nIn March 2025, we entered into a definitive agreement to acquire Wiz, a leading cloud security platform, for $32.0 billion, subject to closing adjustments, in an all-cash transaction. The acquisition of Wiz is expected to close in 2026, subject to customary closing conditions, including the receipt of regulatory approvals. Upon the close of the acquisition, Wiz will be part of the Google Cloud segment.\nNote 9. Goodwill\nChanges in the carrying amount of goodwill for the nine months ended September 30, 2025 were as follows (in millions):\nNote 10. Commitments and Contingencies\nCommitments\nWe have content licensing agreements with future fixed or minimum guaranteed commitments of $7.7 billion as of September 30, 2025, of which the majority is paid quarterly through the first quarter of 2030.\nIndemnifications\nIn the normal course of business, including to facilitate transactions in our services and products and corporate activities, we indemnify certain parties, including advertisers, Google Network partners, distribution partners, customers of Google Cloud offerings, lessors, and service providers with respect to certain matters. We have agreed to defend and/or indemnify certain parties against losses arising from a breach of representations or covenants, or out of intellectual property infringement or other claims made against certain parties. Several of these agreements limit the time within which an indemnification claim can be made and the amount of the claim. In addition, we have entered into indemnification agreements with our officers and directors, and our bylaws contain similar indemnification obligations to our agents.\nIt is not possible to make a reasonable estimate of the maximum potential amount under these indemnification agreements due to the unique facts and circumstances involved in each particular agreement. Additionally, the payments we have made under such agreements have not had a material adverse effect on our results of operations, cash flows, or financial position. However, to the extent that valid indemnification claims arise in the future, future payments by us could be significant and could have a material adverse effect on our results of operations or cash flows in a particular period.\nAs of September 30, 2025, we did not have any material indemnification claims that were probable or reasonably possible.\nLegal Matters\nWe record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate.\nCertain outstanding matters seek speculative, substantial or indeterminate monetary amounts, substantial changes to our business practices and products, or structural remedies. Significant judgment is required to determine both the likelihood of there being a loss and the estimated amount of a loss related to such matters, and we may be unable to estimate the reasonably possible loss or range of losses. The outcomes of outstanding legal matters are inherently unpredictable and subject to significant uncertainties, and could, either individually or in aggregate, have a material adverse effect.\nWe expense legal fees in the period in which they are incurred.\nAntitrust Matters\nWe are subject to formal and informal inquiries and investigations as well as litigation on various competition matters by regulatory authorities and private parties in the U.S., Europe, and other jurisdictions globally, including the following:\n•Shopping: In June 2017, the EC announced its decision that certain actions taken by Google relating to its display and ranking of shopping search results and ads infringed European antitrust laws and imposed a €2.4 billion fine. In 2024, we made a cash payment of $3.0 billion for the fine.\n•Android: In July 2018, the EC announced its decision that certain provisions in Google's Android-related distribution agreements infringed European antitrust laws, imposed a €4.3 billion fine, and directed the termination of the conduct at issue. We appealed the EC decision and implemented changes to certain of our Android distribution practices. In September 2022, the General Court affirmed the EC decision but reduced the fine from €4.3 billion to €4.1 billion. We subsequently appealed the General Court's affirmation of the EC decision with the European Court of Justice, which remains pending. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022.\n•AdSense for Search: In March 2019, the EC announced its decision that certain provisions in Google's agreements with AdSense for Search partners infringed European antitrust laws, imposed a fine of €1.5 billion, and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. In 2019, we recognized a charge of $1.7 billion for the fine and appealed the EC decision. In September 2024, the General Court overturned the EC decision and annulled the €1.5 billion fine. The EC has appealed the General Court's decision with the European Court of Justice.\n•Search: In October 2020, the U.S. Department of Justice (DOJ) and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia concerning Google's Search and Search advertising practices and its compliance with U.S. antitrust laws. In August 2024, the U.S. District Court for the District of Columbia ruled against Google. In September 2025, a decision on remedies was issued, which, among other things, imposes restrictions on how Google distributes its services, and requires Google to share certain search data with and offer syndication services to certain competitors. We expect a final judgment will be entered in late 2025.\nFurther, in June 2022, the Australian Competition and Consumer Commission (ACCC) opened an investigation into Search distribution practices. In August 2025, we agreed to a settlement with the ACCC requiring, among other things, changes to our Android agreements. Final approval of the settlement remains pending before the court.\nIn October 2023, the Japanese Fair Trade Commission (JFTC) opened an investigation into Search distribution practices. In April 2025, the JFTC issued a cease-and-desist order requiring us to make changes to our Android agreements to ensure they are consistent with Japanese antitrust law. The JFTC did not impose monetary penalties. We are constructively engaging with the JFTC regarding compliance with the order.\n•Advertising Technology: In December 2020, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Eastern District of Texas concerning Google's advertising technology and its compliance with U.S. antitrust laws and state deceptive trade laws. In January 2023, the DOJ, along with a number of state Attorneys General, filed a lawsuit in the U.S. District Court for the Eastern District of Virginia concerning Google's advertising technology and its compliance with U.S. antitrust laws, and a number of additional state Attorneys General subsequently joined the lawsuit. In April 2025, the U.S. District Court for the Eastern District of Virginia issued a mixed decision in the DOJ case against Google, ruling that Google's advertiser tools or acquisitions of DoubleClick and AdMeld were not anticompetitive, but that Google's publisher tools unfairly excluded rivals. A separate proceeding to determine remedies, the range of which vary widely, took place in September 2025, with the parties presenting differing remedy proposals. The DOJ's remedy proposal includes structural remedies that could have a material adverse effect on our business. We expect closing arguments to be held in November 2025, after which the court will issue its final judgment. After that judgment, we plan to appeal the adverse portion of the April 2025 decision and potentially aspects of the remedies decision. A trial in the state Attorneys General case in the Eastern District of Texas will take place after a decision on remedies is issued in the DOJ case. Given the nature of these matters, we cannot estimate a possible loss.\nFurther, in June 2023, the EC issued a Statement of Objections informing Google of its preliminary view that Google infringed European antitrust laws relating to its advertising technology. In September 2025, the EC announced its decision that Google had infringed European competition laws through \"self-preferencing\" practices on the buy-side and the sell-side relating to Google's advertising technology business. The EC decision imposed a €3.0 billion (approximately $3.5 billion as of September 5, 2025) fine and directed Google to cease and desist the alleged \"self-preferencing\" practices. We plan to appeal the ruling. We accrued the fine in the third quarter of 2025, resulting in a charge of $3.5 billion. We are currently engaging with the EC and a group of banking partners to place bank guarantees in the fourth quarter of 2025 in lieu of cash payment.\nIn September 2024, the UK also issued a Statement of Objections concerning Google's advertising technology and its compliance with UK antitrust laws, to which we responded.\n•Google Play: In July 2021, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Northern District of California concerning Google's operation of Android and Google Play and its compliance with U.S. antitrust laws and state antitrust and consumer protection laws. In September 2023, we reached a settlement in principle with 50 state Attorneys General and three territories and recognized a charge. Final approval of the settlement remains pending before the court. In May 2024, we funded the settlement amount to an escrow agent.\nIn December 2023, a California jury delivered a verdict against Google in Epic Games v. Google related to Google Play's business. Epic did not seek monetary damages. The presiding judge issued a remedies decision in October 2024, ordering a variety of alterations to our business models and operations and contractual agreements for Android and Google Play. We appealed the judgment, including the jury verdict and aspects of the remedies ordered, and in July 2025, the Court of Appeals denied our appeal. We are in the process of appealing that decision to the U.S. Supreme Court, and we implemented the ordered remedies in October 2025 while the appeal is pending.\n•European Digital Markets Act: In March 2024, the EC opened two investigations regarding Google's compliance with certain provisions of the European Union's (EU) Digital Markets Act relating to Google Play and Search. In March 2025, the EC issued preliminary findings of non-compliance in both investigations, to which we responded. Given the nature of this matter, we cannot estimate a possible loss.\nIn addition to these antitrust proceedings, private individual and collective actions that overlap with claims pursued by regulatory authorities are pending in the U.S. and in several other jurisdictions, including across Europe. Given the nature of these matters, we cannot estimate a possible loss.\nWe believe we have strong arguments against these open claims and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world.\nPrivacy Matters\nWe are subject to a number of privacy-related laws and regulations, and we currently are party to a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. For example, there are ongoing investigations and litigation in the U.S. and the EU, including those relating to our collection and use of location information, alleged violations of state biometric statutes, the choices we offer users, and advertising practices, which could result in significant fines, judgments, and product changes. In October 2025, we finalized a $1.4 billion settlement of certain privacy matters.\nPatent and Intellectual Property Claims\nWe have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products.\nFurther, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business.\nOther\nWe are subject to claims, lawsuits, regulatory and government inquiries and investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, AI training, and other matters. For example, we periodically have data incidents that we report to relevant regulators as required by law. Such claims, consent orders, lawsuits, regulatory and government investigations, and other proceedings could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results.\nWe have ongoing legal matters relating to Russia. For example, some matters concern civil judgments that include compounding penalties imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not expect these ongoing legal matters will have a material adverse effect.\nNon-Income Taxes\nWe are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations.\nSee Note 14 for information regarding income tax contingencies.\nNote 11. Stockholders' Equity\nShare Repurchases\nIn the three and nine months ended September 30, 2025, we continued to repurchase both Class A and Class C shares in a manner deemed in the best interest of the company and its stockholders, taking into account the economic cost and prevailing market conditions, including the relative trading prices and volumes of the Class A and Class C shares. During the three and nine months ended September 30, 2025, we repurchased $11.6 billion and $40.1 billion of Alphabet's Class A and Class C shares, respectively.\nIn April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its Class A and Class C shares. In April 2025, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of Class A and Class C shares. As of September 30, 2025, $74.8 billion remained available for Class A and Class C share repurchases.\nThe following table presents Class A and Class C shares repurchased and subsequently retired (in millions):\n(1) Shares repurchased include unsettled repurchases.\nRepurchases are executed from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases or privately negotiated transactions, including through Rule 10b5-1 plans. The repurchase program does not have an expiration date.\nDividends\nIn the three and nine months ended September 30, 2025, total cash dividends were $1.2 billion and $3.6 billion for Class A, $177 million and $527 million for Class B, and $1.1 billion and $3.4 billion for Class C shares, respectively.\nIn April 2025, the Board of Directors of Alphabet increased the quarterly cash dividend by 5% to $0.21 per share of outstanding Class A, Class B, and Class C shares.\nThe company has declared a quarterly cash dividend in the current quarter, and intends to pay quarterly cash dividends in the future, subject to review and approval by the company’s Board of Directors in its sole discretion.\nNote 12. Net Income Per Share\nThe following table sets forth the computation of basic and diluted net income per share of Class A, Class B, and Class C stock (in millions, except per share amounts):\n(1)Not applicable for consolidated net income per share.\n(1)Not applicable for consolidated net income per share.\nFor the periods presented above, the holders of each class are entitled to equal per share dividends or distributions in liquidation in accordance with the Amended and Restated Certificate of Incorporation of Alphabet Inc. Holders of Alphabet unvested stock units are awarded dividend equivalents, which are subject to the same vesting conditions as the underlying award, and settled in Class C shares.\nImmaterial differences in net income per share across our Class A, Class B, and Class C shares may arise due to the allocation of distributed earnings, which is based on the holders as of the record date, compared with the allocation of undistributed earnings and number of shares, which is based on the weighted average shares outstanding over the periods.\nNote 13. Compensation Plans\nStock-Based Compensation\nFor the three months ended September 30, 2024 and 2025, total stock-based compensation (SBC) expense was $5.9 billion and $6.4 billion, including amounts associated with awards we expect to settle in Alphabet stock of $5.7 billion and $6.1 billion, respectively. For the nine months ended September 30, 2024 and 2025, total SBC expense was $17.0 billion and $17.9 billion, including amounts associated with awards we expect to settle in Alphabet stock of $16.4 billion and $17.2 billion, respectively.\nStock-Based Award Activities\nThe following table summarizes the activities for unvested Alphabet restricted stock units (RSUs), which include dividend equivalents awarded to holders of unvested stock, for the nine months ended September 30, 2025 (in millions, except per share amounts):\nAs of September 30, 2025, there was $47.0 billion of unrecognized compensation cost related to unvested RSUs. This amount is expected to be recognized over a weighted-average period of 2.6 years.\nNote 14. Income Taxes\nThe following table presents provision for income taxes (in millions, except for effective tax rate):\nWe are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. The total amount of gross unrecognized tax benefits was $12.6 billion and $13.1 billion, of which $10.0 billion and $11.1 billion, if recognized, would affect our effective tax rate, as of December 31, 2024 and September 30, 2025, respectively.\nChanges to U.S. tax law enacted on July 4, 2025, allow for immediate expensing of domestic research and experimentation costs, accelerated depreciation on eligible capital expenditures, and other tax law changes impacting 2025 with certain changes effective in 2026. These changes are reflected in our results for the three and nine months ended September 30, 2025.\nNote 15. Information about Segments and Geographic Areas\nWe report our segment results as Google Services, Google Cloud, and Other Bets:\n•Google Services includes products and services such as ads, Android, Chrome, devices, Google Maps, Google Play, Search, and YouTube. Google Services generates revenues primarily from advertising; fees received for consumer subscription-based products such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as Google One; the sale of apps and in-app purchases; and devices.\n•Google Cloud includes infrastructure and platform services, applications, and other services for enterprise customers. Google Cloud generates revenues primarily from consumption-based fees and subscriptions received for Google Cloud Platform services, Google Workspace communication and collaboration tools, and other enterprise services.\n•Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of autonomous transportation services, healthcare-related services, and internet services.\nRevenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and devices, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. These costs, including the associated depreciation, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue.\nCertain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include certain AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with employee severance and office space reductions are also not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments.\nOur Chief Operating Decision Maker (CODM) is our Chief Executive Officer, Sundar Pichai. Our CODM uses segment operating income (loss) to allocate resources to our segments in our annual planning process and to assess the performance of our segments, primarily by monitoring actual results versus the annual plan. Our operating segments are not evaluated using asset information.\nThe following table presents revenue, profitability, and expense information about our segments (in millions):(1) Includes the EC fine of $3.5 billion for the three and nine months ended September 30, 2025.\nGoogle Services and Google Cloud employee compensation expenses include the costs associated with direct and allocated employees. Google Services and Google Cloud other costs and expenses primarily include direct costs, such as advertising and promotional activities and third-party services fees as well as allocated costs, such as technical infrastructure and office facilities usage costs. Additionally, Google Services other costs and expenses include content and traffic acquisition costs and device costs.\nSee Note 2 for information relating to revenues by geography.\nThe following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions):",
    "part_1_item_2": "ITEM 2.MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together with \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes included under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the fiscal year ended December 31, 2024, including Part I, Item 1A \"Risk Factors.\"\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses - the largest of which is Google. We report Google in two segments, Google Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further details on our segments, see Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices. For additional information on how we recognize revenue, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\nIn addition to the long-term trends and their financial effect on our business discussed in \"Trends in Our Business and Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024, fluctuations in our revenues have been and may continue to be affected by a combination of factors, including:\n•changes in foreign currency exchange rates;\n•changes in pricing, such as those resulting from changes in fee structures, discounts, and customer incentives;\n•general economic conditions and various external dynamics, including geopolitical events, regulations, and other measures and their effect on advertiser, consumer, and enterprise spending;\n•new product, service, and market launches; and\n•seasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), other sources (\"Google subscriptions, platforms, and devices\"), Google Cloud, and Other Bets have been, and may continue to be, affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google subscriptions, platforms, and devices revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following:\n•Google Search & other, which includes revenues generated on Google search properties (including revenues from traffic generated by search distribution partners who use Google.com as their default search in browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and Google Play;\n•YouTube ads, which includes revenues generated on YouTube properties; and\n•Google Network, which includes revenues generated on Google Network properties participating in AdMob, AdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our advertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while impressions and cost-per-impression pertain to traffic on our Google Network properties.\nPaid clicks represent engagement by users and include clicks on advertisements by end-users on Google search properties and other Google owned and operated properties including Gmail, Google Maps, and Google Play. Cost-per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the average amount we charge advertisers for each engagement by users.\nImpressions include impressions displayed to users on Google Network properties participating primarily in AdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based revenues divided by our total number of impressions, and represents the average amount we charge advertisers for each impression displayed to users.\nAs our business evolves, we periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues generated by the corresponding click and impression activity.\nFluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google Search & other properties and the change in impressions and cost-per-impression on Google Network properties and the correlation between these items have been, and may continue to be, affected by factors in addition to the general factors described above, such as:\n•advertiser competition for keywords;\n•changes in advertising quality, formats, delivery, or policy;\n•changes in device mix;\n•seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as traditional retail seasonality; and\n•traffic growth in emerging markets compared to more mature markets and across various verticals and channels.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues are comprised of the following:\n•consumer subscriptions, which primarily include revenues from YouTube services, such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as Google One;\n•platforms, which primarily include revenues from Google Play sales of apps and in-app purchases;\n•devices, which primarily include sales of the Pixel family of devices; and\n•other products and services.\nFluctuations in our Google subscriptions, platforms, and devices revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand, number of subscribers, and the timing of product launches.\nGoogle Cloud\nGoogle Cloud revenues are comprised of the following:\n•Google Cloud Platform, which generates consumption-based fees and subscriptions for infrastructure, platform, and other services. These services provide access to solutions such as AI offerings including our AI infrastructure, Vertex AI platform, and Gemini Enterprise: cybersecurity; and data and analytics;\n•Google Workspace, which includes subscriptions for cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet, with integrated features like Gemini for Google Workspace; and\n•other enterprise services.\nFluctuations in our Google Cloud revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand.\nOther Bets\nRevenues from Other Bets are generated primarily from the sale of autonomous transportation services, healthcare-related services, and internet services.\nCosts and Expenses\nOur cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Additionally, fluctuations in employee compensation expenses may not directly correlate with changes in headcount due to factors such as annual SBC awards that generally vest over four years.\nCost of Revenues\nCost of revenues is comprised of TAC and other costs of revenues.\n•TAC includes:\n◦amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and\n◦amounts paid to Google Network partners primarily for ads displayed on their properties.\n•Other cost of revenues primarily includes:\n◦content acquisition costs, which are payments to content providers from whom we license video and other content for distribution, primarily related to YouTube (we pay fees to these content providers based on revenues generated, subscriber counts, or a flat fee);\n◦depreciation expense related to our technical infrastructure;\n◦employee compensation expenses related to our technical infrastructure and other operations such as content review and customer and product support;\n◦inventory and other costs related to the devices we sell; and\n◦other technical infrastructure operations costs, including network capacity, energy, and equipment costs.\nTAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners.\nOperating Expenses\nOperating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative.\nThe main components of our R&D expenses are:\n•depreciation;\n•employee compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; and\n•third-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts.\nThe main components of our sales and marketing expenses are:\n•employee compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and\n•spend relating to our advertising and promotional activities in support of our products and services.\nThe main components of our general and administrative expenses are:\n•employee compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions;\n•expenses relating to legal and other matters, including certain fines and settlements; and\n•third-party services fees, including audit, consulting, outside legal, and other outsourced administrative services.\nOther Income (Expense), Net\nOI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments.\nFor additional information, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 and Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 as well as Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nProvision for Income Taxes\nProvision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties.\nFor additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 as well as Note 14 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nExecutive Overview\nThe following table summarizes consolidated financial results (in millions, except per share information and percentages):\n(1) See \"Use of Non-GAAP Constant Currency Information\" below for details relating to our use of constant currency information.\n(2) For additional information on the calculation of diluted EPS, see Note 12 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\n•Revenues were $102.3 billion, an increase of 16% year over year, primarily driven by an increase in Google Services revenues of $10.5 billion, or 14%, and an increase in Google Cloud revenues of $3.8 billion, or 34%.\n•Total constant currency revenues, which exclude the effect of hedging, increased 15% year over year.\n•Cost of revenues was $41.4 billion, an increase of 13% year over year, primarily driven by increases in content acquisition costs, TAC, depreciation expense, and other technical infrastructure operations costs.\n•Operating expenses were $29.7 billion, an increase of 28% year over year, primarily driven by increases in expenses related to legal and other matters, employee compensation expenses, and depreciation expense.\nOther Information:\n•On September 5, 2025, the EC announced its decision that Google had infringed European competition laws. The EC decision imposed a $3.5 billion fine which we accrued in general and administrative expenses in our Google Services segment for the three months ended September 30, 2025.\n•OI&E of $12.8 billion for the three months ended September 30, 2025 included net gains on equity securities of $10.7 billion, primarily related to unrealized gains on our non-marketable equity securities.\n•Changes to U.S. tax law enacted on July 4, 2025, allow, among other things, for immediate expensing of domestic research and experimentation costs and accelerated depreciation on eligible capital expenditures, the effects of which are included in operating cash flows for the three months ended September 30, 2025.\n•Repurchases of Class A and Class C shares were $926 million and $10.6 billion, respectively, totaling $11.6 billion for the three months ended September 30, 2025.\n•Operating cash flow was $48.4 billion for the three months ended September 30, 2025.\n•Capital expenditures, which primarily reflected investments in technical infrastructure, were $24.0 billion for the three months ended September 30, 2025.\n•As of September 30, 2025, we had 190,167 employees.\nWe are monitoring ongoing developments surrounding international trade and the macroeconomic environment. As a result of volatility in international trade and financial markets, we may experience direct and indirect effects on our business, operations, and financial results. Our past results may not be indicative of our future performance, and our financial results may differ materially from historical trends.\nFinancial Results\nRevenues\nThe following table presents revenues by type (in millions):\nGoogle Services\nGoogle advertising revenues\nGoogle Search & other\nGoogle Search & other revenues increased $7.2 billion and $17.4 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025. The overall growth was driven by interrelated factors including increases in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery.\nYouTube ads\nYouTube ads revenues increased $1.3 billion and $3.3 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025. The growth was driven by our direct response advertising products followed by our brand advertising products, both of which benefited from increased spending by our advertisers.\nGoogle Network\nGoogle Network revenues decreased $194 million from the three months ended September 30, 2024 to the three months ended September 30, 2025, primarily due to a decrease in AdSense, partially offset by an increase in AdMob revenues.\nGoogle Network revenues decreased $441 million from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily due to a decrease in AdSense and Google Ad Manager revenues.\nMonetization Metrics\nThe following table presents changes in monetization metrics for Google Search & other revenues (paid clicks and cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a percentage, from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025:\nChanges in paid clicks and impressions are driven by a number of interrelated factors, including changes in advertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search queries resulting from changes in user adoption and usage, primarily on mobile devices.\nChanges in cost-per-click and cost-per-impression are driven by a number of interrelated factors including changes in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix, property mix, and changes in foreign currency exchange rates.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues increased $2.2 billion and $5.7 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025. The growth was primarily driven by an increase in subscriptions revenues. This increase was primarily due to the contribution from growth in paid subscriptions across both YouTube services and Google One.\nGoogle Cloud\nGoogle Cloud revenues increased $3.8 billion and $9.8 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025 primarily driven by growth in Google Cloud Platform largely from infrastructure services.\nRevenues by Geography\nThe following table presents revenues by geography as a percentage of revenues, determined based on the addresses of our customers:\nFor additional information, see Note 2 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nUse of Non-GAAP Constant Currency Information\nInternational revenues, which represent a significant portion of our revenues, are generally transacted in multiple currencies and therefore are affected by fluctuations in foreign currency exchange rates.\nThe effect of currency exchange rates on our business is an important factor in understanding period-to-period comparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP percentage change in constant currency revenues (\"percentage change in constant currency revenues\") for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe the presentation of results on a constant currency basis in addition to GAAP results helps improve the ability to understand our performance, because it excludes the effects of foreign currency volatility that are not indicative of our core operating results.\nConstant currency information compares results between periods as if exchange rates had remained constant period over period. We define constant currency revenues as revenues excluding the effect of foreign currency exchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated level. We use constant currency revenues to determine the constant currency revenue percentage change on a year-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior year comparable period exchange rates, as well as excluding any hedging effects realized in the current period.\nConstant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods.\nThese results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP.\nThe following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages):\n(1)Total constant currency revenues of $101.2 billion for the three months ended September 30, 2025 increased $13.0 billion compared to $88.3 billion in revenues, excluding hedging effect, for the three months ended September 30, 2024.\nEMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the euro and British pound.\nAPAC revenue growth was not materially affected by changes in foreign currency exchange rates.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso.\n(1)Total constant currency revenues of $288.8 billion for the nine months ended September 30, 2025 increased $35.4 billion compared to $253.4 billion in revenues, excluding hedging effect, for the nine months ended September 30, 2024.\nEMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the euro and British pound, partially offset by the U.S. dollar strengthening relative to the Turkish lira.\nAPAC revenue growth was not materially affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Australian dollar and Indian rupee, partially offset by the U.S dollar weakening relative to the Japanese yen.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Brazilian real and Mexican peso.\nCosts and Expenses\nCost of Revenues\nThe following table presents cost of revenues, including TAC (in millions, except percentages):\nCost of revenues increased $4.9 billion from the three months ended September 30, 2024 to the three months ended September 30, 2025 due to an increase in other cost of revenues and TAC of $3.7 billion and $1.2 billion, respectively. Cost of revenues increased $11.1 billion from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 due to an increase in other cost of revenues and TAC of $7.8 billion and $3.3 billion, respectively.\nThe increase in TAC from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. The TAC rate decreased from 20.8% to 20.1% from the three months ended September 30, 2024 to the three months ended September 30, 2025 and decreased from 20.8% to 20.4% from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rates on Google Search & other and Google Network revenues were substantially consistent from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025.\nThe increase in other cost of revenues from the three months ended September 30, 2024 to the three months ended September 30, 2025 was primarily due to increases in content acquisition costs, largely for YouTube, depreciation expense, other technical infrastructure operations costs, and devices costs.\nThe increase in other cost of revenues from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 was primarily due to increases in content acquisition costs, largely for YouTube, depreciation expense, and other technical infrastructure operations costs.\nResearch and Development\nThe following table presents R&D expenses (in millions, except percentages):\nR&D expenses increased $2.7 billion from the three months ended September 30, 2024 to the three months ended September 30, 2025, primarily driven by increases in employee compensation expenses of $1.5 billion, depreciation expense of $659 million, and other technical infrastructure operations costs of $407 million.\nR&D expenses increased $6.3 billion from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily driven by increases in employee compensation expenses of $3.0 billion and depreciation expense of $1.7 billion.\nSales and Marketing\nThe following table presents sales and marketing expenses (in millions, except percentages):\nSales and marketing expenses decreased $22 million from the three months ended September 30, 2024 to the three months ended September 30, 2025, due to a combination of factors, none of which were individually significant.\nSales and marketing expenses increased $33 million from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily driven by an increase in advertising and promotional activities of $550 million, partially offset by a decrease in employee compensation expenses of $369 million.\nGeneral and Administrative\nThe following table presents general and administrative expenses (in millions, except percentages):\nGeneral and administrative expenses increased $3.8 billion from the three months ended September 30, 2024 to the three months ended September 30, 2025, primarily driven by an increase in expenses related to legal and other matters of $3.8 billion, largely the result of the $3.5 billion EC fine.\nGeneral and administrative expenses increased $6.4 billion from the nine months ended September 30, 2024 to the nine months ended September 30, 2025, primarily driven by an increase in expenses related to legal and other matters of $6.3 billion, largely the result of the $3.5 billion EC fine accrued in the third quarter of 2025 and a $1.4 billion legal accrual made in the second quarter of 2025.\nSegment Profitability\nWe report our segment results as Google Services, Google Cloud, and Other Bets. Additionally, certain costs are not allocated to our segments because they represent Alphabet-level activities. For further details on our segments, see Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nThe following table presents segment operating income (loss) (in millions):\n(1)In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $17 million and $(207) million for the three months ended September 30, 2024 and 2025, respectively, and $191 million and $(60) million for the nine months ended September 30, 2024 and 2025, respectively. Alphabet-level activities include charges related to employee severance and office space charges.\nGoogle Services\nGoogle Services operating income increased $2.7 billion and $10.8 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025, respectively. The increase in operating income was primarily driven by an increase in revenues, partially offset by an increase in expenses related to legal and other matters, content acquisition costs, and TAC.\nGoogle Cloud\nGoogle Cloud operating income increased $1.6 billion and $4.6 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025, respectively. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in usage costs for technical infrastructure and employee compensation expenses.\nOther Bets\nOther Bets operating loss increased $310 million and $628 million from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025, respectively. The increase in operating loss was due to a combination of factors, none of which were individually significant.\nOther Income (Expense), Net\nThe following table presents OI&E (in millions):\nOI&E, net increased $9.6 billion and $20.5 billion from the three and nine months ended September 30, 2024 to the three and nine months ended September 30, 2025, respectively. The increase was primarily due to increases in net unrealized gains on equity securities resulting from fair value adjustments on non-marketable equity securities.\nFor additional information, see Note 3 and Note 7 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nProvision for Income Taxes\nThe following table presents provision for income taxes (in millions, except effective tax rate):\nThe effective tax rate increased from the three months ended September 30, 2024 to the three months ended September 30, 2025. This increase was primarily due to a decrease in the U.S. Federal Foreign Derived Intangible Income tax deduction, and a non-deductible EC fine, partially offset by changes in prior period tax positions.\nThe effective tax rate increased from the nine months ended September 30, 2024 to the nine months ended September 30, 2025. This increase was primarily due to a decrease in the U.S. Federal Foreign Derived Intangible\nIncome tax deduction, a non-deductible EC fine and legal settlement in the U.S., a decrease in SBC-related tax benefits, partially offset by changes in prior period tax positions.\nChanges to U.S. tax law enacted on July 4, 2025, allow for immediate expensing of domestic research and experimentation costs, accelerated depreciation on eligible capital expenditures, and other tax law changes impacting 2025 with certain changes effective in 2026. These changes are reflected in our results for the three and nine months ended September 30, 2025.\nThe Organization for Economic Cooperation and Development (OECD) is coordinating negotiations among more than 140 countries with the goal of achieving consensus around substantial changes to international tax policies, including the implementation of a minimum global effective tax rate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect others to follow, however this did not have a material effect on our income tax provision for the period ending September 30, 2025.\nFinancial Condition\nCash, Cash Equivalents, and Marketable Securities\nAs of September 30, 2025, we had $98.5 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities.\nSources, Uses of Cash and Related Trends\nOur principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders.\nThe following table presents cash flows (in millions):\nCash Provided by Operating Activities\nOur largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash through consumer subscriptions, the sale of apps and in-app purchases, and devices. In Google Cloud, we generate cash through consumption-based fees and subscriptions for infrastructure, platform, applications, and other cloud services.\nOur primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for devices, to tax authorities for income taxes, and other general corporate expenditures.\nNet cash provided by operating activities increased from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 due to an increase in cash received from customers, partially offset by an increase in cash payments for cost of revenues and operating expenses.\nCash Used in Investing Activities\nCash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions.\nNet cash used in investing activities increased from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 primarily due to an increase in purchases of property and equipment, driven by investments in technical infrastructure, and a decrease in maturities and sales of marketable securities.\nCash Used in Financing Activities\nCash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, payment of dividends, and repayments of debt.\nNet cash used in financing activities decreased from the nine months ended September 30, 2024 to the nine months ended September 30, 2025 due to an increase in proceeds from issuance of debt, net of repayments.\nLiquidity and Material Cash Requirements\nWe expect existing cash, cash equivalents, short-term marketable securities, and cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months, and thereafter for the foreseeable future.\nCapital Expenditures and Leases\nWe make investments in land, buildings, and servers and network equipment through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products.\nCapital Expenditures\nOur capital investments in property and equipment consist primarily of the following major categories:\n•technical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, and data center land and building construction; and\n•office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\").\nAssets not yet in service are those that are not ready for our intended use, including assets in the process of construction or assembly, and consists primarily of technical infrastructure. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct buildings, and secure and install servers and network equipment.\nDuring the nine months ended September 30, 2024 and 2025, we spent $38.3 billion and $63.6 billion on capital expenditures, respectively. We expect full year 2025 capital expenditures to exceed full year 2024. In 2026, we expect to significantly increase, relative to 2025, our investment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products and services. Depreciation of our property and equipment commences when such assets are ready for our intended use. For the nine months ended September 30, 2024 and 2025, depreciation on property and equipment was $11.1 billion and $15.1 billion, respectively.\nLeases\nAs of September 30, 2025, the amount of total future lease payments under operating and finance leases was $17.5 billion and $2.9 billion, respectively.\nAs of September 30, 2025, we have entered into leases primarily related to data centers that have not yet commenced with future lease payments of $42.6 billion, including a purchase option considered reasonably certain to be exercised. These leases will commence between 2025 and 2031 with non-cancelable lease terms between one and 25 years.\nFor additional information on leases, see Note 4 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nFinancing\nWe have a short-term debt financing program of up to $25.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. As of September 30, 2025, we had $3.0 billion of short-term commercial paper outstanding.\nIn May 2025, we issued $5.0 billion of U.S. dollar-denominated fixed-rate senior unsecured notes in four tranches: $750 million of 4.00% notes due 2030, $1.25 billion of 4.50% notes due 2035, $1.5 billion of 5.25% notes due 2055, and $1.5 billion of 5.30% notes due 2065. Additionally in May 2025, we issued €6.75 billion of euro-denominated fixed-rate senior unsecured notes in five tranches: €1.5 billion of 2.50% notes due 2029, €1.5 billion of 3.00% notes due 2033, €1.25 billion of 3.38% notes due 2037, €1.25 billion of 3.88% notes due 2045, and\n€1.25 billion of 4.00% notes due 2054. The net proceeds from all notes issued in May 2025 are used for general corporate purposes.\nAs of September 30, 2025, we had senior unsecured notes outstanding with a total carrying value of $23.6 billion.\nAs of September 30, 2025, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2026 and $6.0 billion expiring in April 2030. The interest rates for all credit facilities are determined based on a formula using certain market rates. No amounts have been borrowed under the credit facilities.\nFor additional information, see Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nWe primarily utilize contract manufacturers for the assembly of our servers used in our technical infrastructure and devices we sell. We have agreements where we may purchase components directly from suppliers and then supply these components to contract manufacturers for use in the assembly of the servers and devices. Certain of these arrangements result in a portion of the cash received from and paid to the contract manufacturers to be presented as financing activities in the Consolidated Statements of Cash Flows included in Item 1 of this Quarterly Report on Form 10-Q.\nShare Repurchase Program\nIn the three and nine months ended September 30, 2025, we repurchased and subsequently retired 56 million and 220 million shares for $11.6 billion and $40.1 billion, respectively.\nIn April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its Class A and Class C shares. In April 2025, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of Class A and Class C shares. As of September 30, 2025, $74.8 billion remained available for Class A and Class C share repurchases.\nThe following table presents Class A and Class C shares repurchased and subsequently retired (in millions):\n(1)Shares repurchased include unsettled repurchases.\nFor additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nDividend Program\nIn the three and nine months ended September 30, 2025, total cash dividends were $1.2 billion and $3.6 billion for Class A, $177 million and $527 million for Class B, and $1.1 billion and $3.4 billion for Class C shares, respectively.\nIn April 2025, the Board of Directors of Alphabet increased the quarterly cash dividend by 5% to $0.21 per share of outstanding Class A, Class B, and Class C shares.\nThe company has declared a quarterly cash dividend in the current quarter, and intends to pay quarterly cash dividends in the future, subject to review and approval by the company’s Board of Directors in its sole discretion.\nEuropean Commission Fines\nIn 2018 and 2019, the EC announced decisions that certain actions taken by Google infringed European competition law and imposed fines of €4.3 billion ($5.1 billion as of June 30, 2018) and €1.5 billion ($1.7 billion as of March 20, 2019), respectively.\nIn September 2022, the General Court affirmed the EC decision but reduced the 2018 fine from €4.3 billion to €4.1 billion. We subsequently appealed the General Court's affirmation of the EC decision with the European Court of Justice, which remains pending.\nIn September 2024, the EU's General Court overturned the 2019 decision and annulled the €1.5 billion fine. The EC has appealed the General Court's decision to the European Court of Justice.\nIn September 2025, the EC announced its decision that Google had infringed European competition laws through “self-preferencing” practices on the buy-side and the sell-side relating to its advertising technology. The EC imposed a €3.0 billion fine ($3.5 billion as of September 5, 2025), which was accrued in the third quarter of 2025.\nWe included the outstanding EC fines, including any under appeal, in accrued expenses and other current liabilities on our Consolidated Balance Sheets. For additional information, see Note 10 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nTaxes\nAs of September 30, 2025, we had long-term income taxes payable of $10.1 billion primarily related to uncertain tax positions.\nPurchase Commitments and Other Contractual Obligations\nWe have material purchase commitments and other contractual obligations primarily related to energy contracts, licenses (including content licenses), and technical infrastructure and inventory orders. As of September 30, 2025, the total for these commitments was $93.7 billion, of which $72.5 billion was short-term, mostly related to technical infrastructure and inventory orders. These amounts reflect commitments and obligations through open purchase orders as well as the non-cancelable portion or the minimum cancellation fee in certain agreements. For those agreements with variable terms, we do not estimate the non-cancelable obligation beyond any minimum quantities and/or pricing as of September 30, 2025. In certain instances, the amount of our contractual obligations may change based on the expected timing of order fulfillment from our suppliers. For more information related to our content licenses, see Note 10 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nIn addition, we regularly enter into multi-year, non-cancellable agreements to purchase renewable energy and energy attributes, such as renewable energy certificates. These agreements do not include a minimum dollar commitment. The amounts to be paid under these agreements are based on the actual volumes to be generated and are not readily determinable.\nWe may experience increases in the costs associated with our purchase commitments and other contractual obligations as a result of ongoing developments surrounding international trade. For details on risks related to our manufacturing and supply chain and other risks, refer to Part I, Item 1A, \"Risk Factors\" in our Annual Report on Form 10-K for the fiscal year ending December 31, 2024.\nPending Acquisition\nIn March 2025, we entered into a definitive agreement to acquire Wiz, a leading cloud security platform, for $32.0 billion, subject to closing adjustments, in an all-cash transaction. The acquisition of Wiz is expected to close in 2026, subject to customary closing conditions, including the receipt of regulatory approvals. For additional information, see Note 8 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nCritical Accounting Estimates\nSee Part II, Item 7, \"Critical Accounting Estimates\" in our Annual Report on Form 10-K for the year ended December 31, 2024.\nAvailable Information\nOur website is located at www.abc.xyz, and our investor relations website is located at www.abc.xyz/investor. Access to our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and our Proxy Statements, and any amendments to these reports, is available on our investor relations website, free of charge, after we file or furnish them with the SEC and they are available on the SEC's website at www.sec.gov.\nWe webcast via our investor relations YouTube channel and website our earnings calls and certain events we participate in or host with members of the investment community. Our investor relations website also provides notifications of news or announcements regarding our financial performance and other items that may be material or of interest to our investors, including SEC filings, investor events, press and earnings releases, and blogs. We also share Google news and product updates on Google’s Keyword blog at https://www.blog.google/ and News From Google page on X at x.com/NewsFromGoogle, and our executive officers may also use certain social media channels, such as X and LinkedIn, to communicate information about earnings results and company updates, which\nmay be of interest or material to our investors. Further, corporate governance information, including our certificate of incorporation, bylaws, governance guidelines, board committee charters, and code of conduct, is also available on our investor relations website under the heading \"Governance.\" The information contained on, or that may be accessed through our websites or our executive officers' social media channels, is not incorporated by reference into this Quarterly Report on Form 10-Q or in any other report or document we file with the SEC, and any references to our websites are intended to be inactive textual references only.",
    "part_1_item_3": "ITEM 3.QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nFor quantitative and qualitative disclosures about market risk, refer to Part II, Item 7A, \"Quantitative and Qualitative Disclosures About Market Risk\" in our Annual Report on Form 10-K for the year ended December 31, 2024.",
    "part_1_item_4": "ITEM 4.CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our chief executive officer and chief financial officer, evaluated the effectiveness of our disclosure controls and procedures pursuant to Rule 13a-15 under the Exchange Act, as of the end of the period covered by this Quarterly Report on Form 10-Q.\nBased on this evaluation, our chief executive officer and chief financial officer concluded that, as of September 30, 2025, our disclosure controls and procedures are designed at a reasonable assurance level and are effective to provide reasonable assurance that information we are required to disclose in reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to our management, including our chief executive officer and chief financial officer, as appropriate, to allow timely decisions regarding required disclosure.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal control over financial reporting that occurred during the quarter ended September 30, 2025 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nLimitations on Effectiveness of Controls and Procedures\nIn designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives. In addition, the design of disclosure controls and procedures must reflect the fact that there are resource constraints and that management is required to apply its judgment in evaluating the benefits of possible controls and procedures relative to their costs.",
    "part_2": "PART II. OTHER INFORMATION\nITEM 1.LEGAL PROCEEDINGS\nFor a description of our material pending legal proceedings, see Note 10 “Commitments and Contingencies - Legal Matters” of the Notes to Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q, which is incorporated herein by reference.\nITEM 1A.RISK FACTORS\nOur operations and financial results are subject to various risks and uncertainties, including but not limited to those described in Part I, Item 1A, \"Risk Factors\" in our Annual Report on Form 10-K for the year ended December 31, 2024, which could harm our business, reputation, financial condition, and operating results, and affect the trading price of our Class A and Class C stock.\nFor additional information about the ongoing material legal proceedings to which we are subject, see Legal Proceedings in Part II, Item 1 of this Quarterly Report on Form 10-Q.\nITEM 2.UNREGISTERED SALES OF EQUITY SECURITIES AND USE OF PROCEEDS\nIssuer Purchases of Equity Securities\nThe following table presents information with respect to Alphabet's repurchases of Class A and Class C stock during the quarter ended September 30, 2025.\n(1) Repurchases are being executed from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases or privately negotiated transactions, including through Rule 10b5-1 plans. The repurchase program does not have an expiration date. For additional information related to share repurchases, see Note 11 of the Notes to Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q.\n(2) Average price paid per share includes costs associated with the repurchases.\nITEM 5.OTHER INFORMATION\n10b5-1 Trading Plans\nDuring the quarter ended September 30, 2025, the following Section 16 director adopted, modified, or terminated a “Rule 10b5-1 trading arrangement” (as defined in Item 408 of Regulation S-K of the Exchange Act).\n•Frances Arnold, a member of the Board of Directors of Alphabet, adopted a trading plan on August 21, 2025 (with the first trade under the plan scheduled for December 1, 2025). The trading plan will be effective until July 13, 2027 to sell 50% of the (net) shares resulting from the vesting of approximately 3,357 (gross) shares of Class C Capital Stock (excluding the dividend equivalent units), in addition to 50% of the (net) shares of any future grants awarded during the term of the plan (in each case, net shares are net of tax withholding).\nThere were no “non-Rule 10b5-1 trading arrangements” (as defined in Item 408 of Regulation S-K of the Exchange Act) adopted, modified, or terminated during the quarter ended September 30, 2025 by our directors and Section 16 officers.\nRequired Disclosure Pursuant to Section 13(r) of the Exchange Act\nDuring the quarter ended September 30, 2025, Google LLC, a subsidiary of Alphabet, filed a notification with the Russian Federal Security Service (FSB) pursuant to Russian encryption control requirements, which must be complied with prior to the import of covered items. Neither we nor our subsidiaries generated any gross revenues or\nnet profits directly from such activity and neither we nor our subsidiaries sell to the FSB. In the ordinary course of its business, Alphabet expects that Google LLC will continue to file these notifications as required under Russian law.\nITEM 6.EXHIBITS\nExhibit\nNumber Description Incorporated by reference herein\nForm Date\n31.01 * Certification of Chief Executive Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.02 * Certification of Chief Financial Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.01 ‡ Certifications of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS * Inline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH * Inline XBRL Taxonomy Extension Schema Document\n101.CAL * Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF * Inline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB * Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE * Inline XBRL Taxonomy Extension Presentation Linkbase Document\n* Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n__________________________\n* Filed herewith.\n‡ Furnished herewith.",
    "part_2_item_1": "ITEM 1.LEGAL PROCEEDINGS\nFor a description of our material pending legal proceedings, see Note 10 “Commitments and Contingencies - Legal Matters” of the Notes to Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q, which is incorporated herein by reference.",
    "part_2_item_1A": "ITEM 1A.RISK FACTORS\nOur operations and financial results are subject to various risks and uncertainties, including but not limited to those described in Part I, Item 1A, \"Risk Factors\" in our Annual Report on Form 10-K for the year ended December 31, 2024, which could harm our business, reputation, financial condition, and operating results, and affect the trading price of our Class A and Class C stock.\nFor additional information about the ongoing material legal proceedings to which we are subject, see Legal Proceedings in Part II, Item 1 of this Quarterly Report on Form 10-Q.",
    "part_2_item_2": "ITEM 2.UNREGISTERED SALES OF EQUITY SECURITIES AND USE OF PROCEEDS\nIssuer Purchases of Equity Securities\nThe following table presents information with respect to Alphabet's repurchases of Class A and Class C stock during the quarter ended September 30, 2025.\n(1) Repurchases are being executed from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases or privately negotiated transactions, including through Rule 10b5-1 plans. The repurchase program does not have an expiration date. For additional information related to share repurchases, see Note 11 of the Notes to Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q.\n(2) Average price paid per share includes costs associated with the repurchases.",
    "part_2_item_3": "",
    "part_2_item_4": "",
    "part_2_item_5": "ITEM 5.OTHER INFORMATION\n10b5-1 Trading Plans\nDuring the quarter ended September 30, 2025, the following Section 16 director adopted, modified, or terminated a “Rule 10b5-1 trading arrangement” (as defined in Item 408 of Regulation S-K of the Exchange Act).\n•Frances Arnold, a member of the Board of Directors of Alphabet, adopted a trading plan on August 21, 2025 (with the first trade under the plan scheduled for December 1, 2025). The trading plan will be effective until July 13, 2027 to sell 50% of the (net) shares resulting from the vesting of approximately 3,357 (gross) shares of Class C Capital Stock (excluding the dividend equivalent units), in addition to 50% of the (net) shares of any future grants awarded during the term of the plan (in each case, net shares are net of tax withholding).\nThere were no “non-Rule 10b5-1 trading arrangements” (as defined in Item 408 of Regulation S-K of the Exchange Act) adopted, modified, or terminated during the quarter ended September 30, 2025 by our directors and Section 16 officers.\nRequired Disclosure Pursuant to Section 13(r) of the Exchange Act\nDuring the quarter ended September 30, 2025, Google LLC, a subsidiary of Alphabet, filed a notification with the Russian Federal Security Service (FSB) pursuant to Russian encryption control requirements, which must be complied with prior to the import of covered items. Neither we nor our subsidiaries generated any gross revenues or\nnet profits directly from such activity and neither we nor our subsidiaries sell to the FSB. In the ordinary course of its business, Alphabet expects that Google LLC will continue to file these notifications as required under Russian law.",
    "part_2_item_6": "ITEM 6.EXHIBITS\nExhibit\nNumber Description Incorporated by reference herein\nForm Date\n31.01 * Certification of Chief Executive Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.02 * Certification of Chief Financial Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.01 ‡ Certifications of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS * Inline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH * Inline XBRL Taxonomy Extension Schema Document\n101.CAL * Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF * Inline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB * Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE * Inline XBRL Taxonomy Extension Presentation Linkbase Document\n* Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n__________________________\n* Filed herewith.\n‡ Furnished herewith."
}