{
    "cik": "1045810",
    "company": "NVIDIA CORP",
    "filing_type": "8-K",
    "filing_date": "2025-01-17",
    "period_of_report": "2025-01-13",
    "sic": "3674",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "0126",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1045810/0001045810-25-000007-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1045810/000104581025000007/nvda-20250113.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1045810/0001045810-25-000007.txt",
    "filename": "1045810_8K_2025_0001045810-25-000007.htm",
    "item_1.01": "",
    "item_1.02": "",
    "item_1.03": "",
    "item_1.04": "",
    "item_1.05": "",
    "item_2.01": "",
    "item_2.02": "",
    "item_2.03": "",
    "item_2.04": "",
    "item_2.05": "",
    "item_2.06": "",
    "item_3.01": "",
    "item_3.02": "",
    "item_3.03": "",
    "item_4.01": "",
    "item_4.02": "",
    "item_5.01": "",
    "item_5.02": "",
    "item_5.03": "",
    "item_5.04": "",
    "item_5.05": "",
    "item_5.06": "",
    "item_5.07": "",
    "item_5.08": "",
    "item_6.01": "",
    "item_6.02": "",
    "item_6.03": "",
    "item_6.04": "",
    "item_6.05": "",
    "item_7.01": "",
    "item_8.01": "Item 8.01 Other Events\nThe “AI Diffusion” Rule\nOn January 13, 2025, the U.S. Government announced that it submitted the Interim Final Rule, “Export Control Framework for Artificial Intelligence Diffusion,” or the IFR, for publication in the Federal Register. The rule published in the Federal Register on January 15, 2025 at 90 Fed. Reg. 4544.\nAfter a 120-day delayed compliance period, the IFR will, unless modified, impose a worldwide licensing requirement on all products classified under Export Control Classification Numbers, or ECCNs, 3A090.a, 4A090.a, or corresponding .z ECCNs, including all related software and technology. Any system that incorporates one or more of the covered integrated circuits, or ICs, (including but not limited to NVIDIA DGX, HGX, and MGX systems) will be covered by the new licensing requirement. The licensing requirement will include future NVIDIA ICs, boards, or systems classified with ECCN 3A090.a or 4A090.a, or corresponding .z ECCNs, achieving certain total processing performance and/or performance density.\nUnless one of the new license exceptions is available to specific transactions, the worldwide licensing requirements will apply to the following NVIDIA products, and any others we develop that meet the characteristics of 3A090.a or 4A090.a, including but not limited to: A100, A800, H100, H200, H800, B100, B200, GB200, L4, L40S, and RTX 6000 Ada.\nThe IFR is subject to a notice and public comment period of 120 days from publication, i.e., by May 15, 2025. Unless the IFR is modified, in whole or in part, or withdrawn altogether by the incoming Trump Administration, exporters, reexports, and transferors are required to begin compliance with the IFR’s licensing, reporting, and other requirements on May 15, 2025.\nThe Company supports U.S. leadership in innovation by providing cutting-edge solutions, working to make American advancements a global standard, and constantly pursuing rapid progress. The Company supports creating new datacenters in the United States and promotes efforts to develop the necessary infrastructure. The Company also supports the safe and responsible development and deployment of all AI-powered systems and will provide feedback on the IFR during the notice and comment period.\nThe “Additional Due Diligence Measures” Rule\nOn January 16, 2025, the Bureau of Industry and Security, Department of Commerce, published a rule entitled “Implementation of Additional Due Diligence Measures for Advanced Computing Integrated Circuits.” The rule is intended to reduce the diversion of ICs to unauthorized end uses or end users that meet the control parameters of ECCN 3A090 by end users who misrepresent the performance capabilities of their ICs to the foundries that manufacture them or the companies that assemble the ICs, or OSATs, into packages. The rule requires additional diligence for foundries and OSATs to verify technical parameters, although approved IC designers are considered a reliable source to verify technical parameters of the applicable advanced logic ICs. NVIDIA Corporation is an approved IC designer and thus the rule is not expected to have an impact on our operations or on product sales to China.\nCertain statements in this Current Report on Form 8-K including statements regarding the scope of the licensing requirement under the IFR; NVIDIA’s products that are subject to the IFR; the impact of the IFR on NVIDIA’s future products; the effectiveness and effective date of the IFR; NVIDIA providing feedback on the IFR during the notice and comment period; and the “Implementation of Additional Due Diligence Measures for Advanced Computing Integrated Circuits” rule unexpected to have an impact on NVIDIA’s operations or on product sales to China are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; NVIDIA’s reliance on third parties to manufacture, assemble, package and test NVIDIA’s products; the impact of technological development and competition; development of new products and technologies or enhancements to NVIDIA’s existing product and technologies; market acceptance of NVIDIA’s products or its partners’ products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of NVIDIA’s products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company’s website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances.",
    "item_9.01": ""
}