{
    "cik": "1045810",
    "company": "NVIDIA CORP",
    "filing_type": "8-K",
    "filing_date": "2025-07-01",
    "period_of_report": "2025-06-25",
    "sic": "3674",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "0125",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1045810/0001045810-25-000179-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1045810/000104581025000179/nvda-20250625.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1045810/0001045810-25-000179.txt",
    "filename": "1045810_8K_2025_0001045810-25-000179.htm",
    "item_1.01": "",
    "item_1.02": "",
    "item_1.03": "",
    "item_1.04": "",
    "item_1.05": "",
    "item_2.01": "",
    "item_2.02": "",
    "item_2.03": "",
    "item_2.04": "",
    "item_2.05": "",
    "item_2.06": "",
    "item_3.01": "",
    "item_3.02": "",
    "item_3.03": "",
    "item_4.01": "",
    "item_4.02": "",
    "item_5.01": "",
    "item_5.02": "",
    "item_5.03": "",
    "item_5.04": "",
    "item_5.05": "",
    "item_5.06": "",
    "item_5.07": "Item 5.07. Submission of Matters to a Vote of Security Holders.\nOn June 25, 2025, at the 2025 Annual Meeting of Stockholders of NVIDIA Corporation, or the 2025 Annual Meeting, the following proposals were adopted or rejected by the margin indicated.\n1. Stockholders approved the election of each of our thirteen (13) director nominees to hold office until the 2026 Annual Meeting of Stockholders of NVIDIA Corporation and until his or her successor is elected or appointed. The results of the voting were as follows:\n2. Stockholders approved, on an advisory basis, the compensation of our named executive officers as disclosed in our definitive proxy statement on Schedule 14A for the 2025 Annual Meeting filed with the Securities and Exchange Commission on May 13, 2025. The results of the voting were as follows:\n3. Stockholders approved the ratification of the selection of PricewaterhouseCoopers LLP as our independent registered accounting firm for our fiscal year ending January 25, 2026. The results of the voting were as follows:\n4. Stockholders did not approve an amendment and restatement of the Certificate of Incorporation of NVIDIA Corporation to remove all supermajority provisions1. The results of the voting were as follows:\n1 Approval of this proposal required at least 66 2/3% of the outstanding shares of our common stock.\n5. Stockholders did not approve the non-binding stockholder proposal to eliminate the holding period requirement to call a special stockholder meeting. The results of the voting were as follows:\n6. Stockholders did not approve the non-binding stockholder proposal to request the adoption of a new director election resignation governance policy. The results of the voting were as follows:\n7. Stockholders did not approve the non-binding stockholder proposal to modify existing reporting on workforce data. The results of the voting were as follows:",
    "item_5.08": "",
    "item_6.01": "",
    "item_6.02": "",
    "item_6.03": "",
    "item_6.04": "",
    "item_6.05": "",
    "item_7.01": "",
    "item_8.01": "",
    "item_9.01": ""
}