{
    "cik": "1045810",
    "company": "NVIDIA CORP",
    "filing_type": "8-K",
    "filing_date": "2025-03-07",
    "period_of_report": "2025-03-03",
    "sic": "3674",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "0125",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1045810/0001045810-25-000039-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1045810/000104581025000039/nvda-20250303.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1045810/0001045810-25-000039.txt",
    "filename": "1045810_8K_2025_0001045810-25-000039.htm",
    "item_1.01": "",
    "item_1.02": "",
    "item_1.03": "",
    "item_1.04": "",
    "item_1.05": "",
    "item_2.01": "",
    "item_2.02": "",
    "item_2.03": "",
    "item_2.04": "",
    "item_2.05": "",
    "item_2.06": "",
    "item_3.01": "",
    "item_3.02": "",
    "item_3.03": "",
    "item_4.01": "",
    "item_4.02": "",
    "item_5.01": "",
    "item_5.02": "Item 5.02. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers.\nAdoption of Fiscal Year 2026 Variable Compensation Plan\nOn March 3, 2025, the Compensation Committee of the Board of Directors, or the Board, of NVIDIA Corporation, or the Company, adopted the Variable Compensation Plan for Fiscal Year 2026, or the 2026 Plan, which provides eligible executive officers the opportunity to earn a variable cash payment based on the level of achievement by the Company of certain corporate performance goals, or the Performance Goals, during fiscal year 2026. The Company operates on a fiscal year ending on the last Sunday in January and designates its fiscal year by the year in which that fiscal year ends. Fiscal year 2026 refers to the Company’s fiscal year ending January 25, 2026.\nThe Compensation Committee has set the Performance Goals for fiscal year 2026 based upon the achievement of specified fiscal year 2026 revenue and has established threshold compensation plan, base compensation plan, and stretch compensation plan levels.\nUnless otherwise determined by the Compensation Committee, a participant must remain an employee through the payment date under the 2026 Plan to be eligible to earn an award.\nThe following table sets forth the respective target award opportunities for base compensation plan achievement for the Company’s named executive officers under the 2026 Plan:\nThe foregoing description is subject to, and qualified in its entirety by, the 2026 Plan, which is filed with this report as Exhibit 10.1 and is incorporated herein by reference.",
    "item_5.03": "",
    "item_5.04": "",
    "item_5.05": "",
    "item_5.06": "",
    "item_5.07": "",
    "item_5.08": "",
    "item_6.01": "",
    "item_6.02": "",
    "item_6.03": "",
    "item_6.04": "",
    "item_6.05": "",
    "item_7.01": "",
    "item_8.01": "",
    "item_9.01": "Item 9.01. Financial Statements and Exhibits.\n(d) Exhibits\nExhibit Number Description\n10.1 Variable Compensation Plan - Fiscal Year 2026\n104 The cover page of this Current Report on Form 8-K, formatted in inline XBRL (included as Exhibit 101)"
}