{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2025-05-16",
    "period_of_report": "2025-05-15",
    "sic": "3711",
    "state_of_inc": "TX",
    "state_location": "TX",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0001628280-25-026148-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000162828025026148/tsla-20250515.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0001628280-25-026148.txt",
    "filename": "1318605_8K_2025_0001628280-25-026148.htm",
    "item_1.01": "",
    "item_1.02": "",
    "item_1.03": "",
    "item_1.04": "",
    "item_1.05": "",
    "item_2.01": "",
    "item_2.02": "",
    "item_2.03": "",
    "item_2.04": "",
    "item_2.05": "",
    "item_2.06": "",
    "item_3.01": "",
    "item_3.02": "",
    "item_3.03": "",
    "item_4.01": "",
    "item_4.02": "",
    "item_5.01": "",
    "item_5.02": "Item 5.02 Departure of Directors or Principal Officers; Election of Directors; Appointment of Principal Officers.\n(d)\nOn May 15, 2025, John R. (Jack) Hartung was appointed to serve as a member of the Board of Directors (the “Board”) of Tesla, Inc. (“Tesla”), as well as a member of the Audit Committee of the Board, effective as of June 1, 2025.\nA son-in-law of Mr. Hartung has been a non-executive, salaried employee of Tesla since December 2016, and does not share a household with Mr. Hartung. He is currently a Service Technician at Tesla and earned total compensation for fiscal year 2024, including the value of equity incentives, of approximately $124,000. This compensation was determined in accordance with Tesla’s compensation practices applicable to employees with similar qualifications and responsibilities and holding similar positions.\nExcept as described above, there are no related party transactions between Tesla and Mr. Hartung that would require disclosure under Item 404(a) of Regulation S-K.\nMr. Hartung is eligible to receive compensation pursuant to Tesla’s standard outside director compensation package as previously approved by the Board. However, Mr. Hartung has waived any entitlement to cash compensation, until further notice to Tesla otherwise, and has joined the remainder of our Board in waiving equity compensation until such time as new determinations are made by the Board with respect to equity compensation.\nA copy of the post published on X on May 16, 2025 announcing the appointment of Mr. Hartung to the Board is attached as Exhibit 99.1",
    "item_5.03": "",
    "item_5.04": "",
    "item_5.05": "",
    "item_5.06": "",
    "item_5.07": "",
    "item_5.08": "",
    "item_6.01": "",
    "item_6.02": "",
    "item_6.03": "",
    "item_6.04": "",
    "item_6.05": "",
    "item_7.01": "",
    "item_8.01": "",
    "item_9.01": "Item 9.01 Financial Statements and Exhibits.\n(d)Exhibits.\nExhibit No. Description\n99.1 X Post, dated May 16, 2025.\n104 Cover Page Interactive Data File (embedded within the Inline XBRL document)."
}