{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2025-08-04",
    "period_of_report": "2025-08-03",
    "sic": "3711",
    "state_of_inc": "TX",
    "state_location": "TX",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0001104659-25-073263-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000110465925073263/tm2522385d1_8k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0001104659-25-073263.txt",
    "filename": "1318605_8K_2025_0001104659-25-073263.htm",
    "item_1.01": "",
    "item_1.02": "",
    "item_1.03": "",
    "item_1.04": "",
    "item_1.05": "",
    "item_2.01": "",
    "item_2.02": "",
    "item_2.03": "",
    "item_2.04": "",
    "item_2.05": "",
    "item_2.06": "",
    "item_3.01": "",
    "item_3.02": "",
    "item_3.03": "",
    "item_4.01": "",
    "item_4.02": "",
    "item_5.01": "",
    "item_5.02": "Item 5.02 Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers.\n(e)\nAs previously disclosed in its quarterly report on Form 10-Q for the three months ended March 31, 2025, the board of directors (the “Board”) of Tesla, Inc., a Texas corporation (the “Company”) established a special committee (the “Special Committee”) to consider certain compensation matters involving Elon Musk, the Company’s Chief Executive Officer. The Special Committee is comprised of disinterested directors Robyn Denholm and Kathleen Wilson-Thompson.\nOn August 3, 2025, the Company approved an award of 96 million shares of restricted stock (the “2025 CEO Interim Award”) to Mr. Musk under the Company’s 2019 Equity Incentive Plan (the “2019 Plan”). The shares underlying the 2025 CEO Interim Award will be issued upon termination or expiration of the waiting period or periods under the Hart-Scott-Rodino Antitrust Improvements Act of 1976, as amended (the “HSR Act”). The 2025 CEO Interim Award was recommended by the Special Committee on August 1, 2025, and approved by the Board, with Mr. Musk and Kimbal Musk recusing, on August 3, 2025.\nSummary of the 2025 CEO Interim Award\nThe 2025 CEO Interim Award consists of the following key terms:\n· Number of Shares: 96 million shares of common stock.\n· Vesting Schedule: The 2025 CEO Interim Award will vest upon the second anniversary of August 3, 2025 (the “Date of Grant”), subject to Mr. Musk remaining in continuous service as CEO or as an executive officer responsible for product development or operations (as approved by the Board’s disinterested directors) through such second anniversary (“Eligible Service”).\n· Early Forfeiture: The 2025 CEO Interim Award will be immediately forfeited and returned to the Company if, prior to vesting, there is a final, non-appealable judgment, order or decision of the Delaware courts with respect to the action captioned Tornetta v. Elon Musk et al., C.A. No. 2018-0408-KSJM (Del. Ch.), or any pending or future appeal, including In re Tesla, Inc. Derivative Litigation, Nos. 10, 2025, 11, 2025 (Del.) (a “Tornetta Decision Event”) that results in Mr. Musk becoming able to exercise in full the performance-based stock option award he was granted in January 2018 (the “2018 CEO Award”).\n· Purchase Price: Mr. Musk must pay the Company $23.34 per share of restricted stock that vests (the “Purchase Price”), which is equal to the exercise price per share of the 2018 CEO Award.\n· Holding Period: Mr. Musk will not sell, transfer or dispose of the shares covered by the 2025 CEO Interim Award until after the fifth anniversary of the Date of Grant, except (i) as required to satisfy taxes due in respect to vesting of the 2025 CEO Interim Award, pay the Purchase Price or both, (ii) in transactions that involve merely a change of form in which Mr. Musk owns the shares covered by the 2025 CEO Interim Award or (iii) as may be permitted by the disinterested directors of the Board acting as administrator, consistent with the Company’s internal policies (with any sales for the purposes described in (i) and (ii) to be conducted through an orderly disposition in coordination with the Company).\n· No Double Dip: If there is a Tornetta Decision Event that results in Mr. Musk becoming able to exercise options covered by the 2018 CEO Award, but does not result in Early Forfeiture, then: (i) if the Tornetta Decision Event occurs prior to vesting, shares covered by the 2025 CEO Interim Award will be reduced to the extent that (a) the sum of the 2025 CEO Interim Award shares and any amount of options exercisable under the 2018 CEO Award exceeds (b) the total number of options subject to the 2018 CEO Award in full (the “Excess Amount”); and (ii) if the Tornetta Decision Event occurs after vesting, Mr. Musk will return or otherwise repay the Company for shares issued under the 2025 CEO Interim Award equal to the Excess Amount and the Company will return or otherwise repay the Purchase Price. Alternatively, rather than returning or repaying as contemplated in clause (ii), Mr. Musk may elect to forfeit the number of options underlying the 2018 CEO Award equal to the Excess Amount.\n· Limited Pledging: Solely in order to satisfy payment of the Purchase Price and taxes due in respect of the vesting of the 2025 CEO Interim Award, Mr. Musk may pledge any shares he beneficially owns (including, without limitation, the 2025 CEO Interim Award and the 2018 CEO Award).\n· Additional Vesting Provisions: The 2025 CEO Interim Award will vest on an accelerated basis prior to the second anniversary of the Date of Grant if Mr. Musk is in continued Eligible Service upon a Change in Control (as defined in the 2019 Plan) or his death.\nThe foregoing summary of the terms of the 2025 CEO Interim Award does not purport to be complete and is qualified in its entirety by reference to both the 2019 Plan, a copy of which was attached as Exhibit 10.8 to the Company’s Annual Report on Form 10-K filed with the Securities and Exchange Commission (the “SEC”) on January 31, 2025, as amended by Amendment No. 1 to the Company’s Annual Report on Form 10-K/A filed with the SEC on April 30, 2025, and the restricted stock award agreement pursuant to which the 2025 CEO Interim Award was granted (the “Award Agreement”), a copy of which is attached as Exhibit 10.1 hereto, each of which is incorporated by reference herein.\nAccounting Consequences of the 2025 CEO Interim Award\nThe Company expects to account for the 2025 CEO Interim Award as a grant of restricted stock with a performance condition in accordance with ASC Topic 718, which for purposes of the 2025 CEO Interim Award is based upon the probability of certain conditions being met. Restricted stock with a performance condition is accounted for by recognizing compensation expense over the requisite service period, based on the accounting grant-date fair value, but only if and when the vesting of the award becomes probable. For accounting purposes, the accounting grant-date fair value of the 2025 CEO Interim Award will be determined on the date that the shares of restricted stock are delivered to Mr. Musk, which will be subject to the termination or expiration of the waiting period or periods under the HSR Act as described above. The accounting grant-date fair value is expected to be based upon the prevailing market price of the Company’s common stock on such date less the Purchase Price, adjusted to take into account an illiquidity discount due to the required holding period. The expense is adjusted for changes to the estimated likelihood of vesting based on the performance condition.\nAs of the date of this report, the Company expects that the performance condition of the 2025 CEO Interim Award will not be deemed to be probable of being met. As a result, the Company currently expects that it will not recognize a compensation expense upon the issuance of the award. However, the Company will reassess the probability of the performance condition being met at least quarterly. If the Company determines that it is probable that the performance condition will be met, at that date, the Company will record a cumulative catch-up expense based on the accounting grant-date fair value of the award (which reflects an illiquidity discount due to transfer and holding restrictions), ratably for the amount of time that has passed since the beginning of the two-year requisite service period and amounting to the remaining portion of the accounting grant-date fair value over the two-year requisite service period. If the performance condition remains not probable as of the end of the two-year requisite service period, such that the 2025 CEO Interim Award remains subject to forfeiture or cancellation, the Company may not recognize the compensation expense at such time. If, at any time following the two-year vesting period, the performance condition becomes probable, the Company will be required to recognize the related compensation expense at that time.\nThe Company is unable to predict whether a compensation expense will be recognized at any time during the two-year requisite service period, or thereafter.\nFor illustrative purposes only, if the approvals had been obtained on August 1, 2025, based on the closing stock price on such date, the accounting grant-date fair value of the 2025 CEO Interim Award would have been approximately $23.7 billion. This amount is based on such assumptions and is provided only for illustrative purposes. It does not reflect the accounting grant-date fair value of the 2025 CEO Interim Award that will be calculated in the future and disclosed in the Company’s future financial statements, nor is it indicative of the timing of recognizing any compensation expenses.",
    "item_5.03": "",
    "item_5.04": "",
    "item_5.05": "",
    "item_5.06": "",
    "item_5.07": "",
    "item_5.08": "",
    "item_6.01": "",
    "item_6.02": "",
    "item_6.03": "",
    "item_6.04": "",
    "item_6.05": "",
    "item_7.01": "Item 7.01 Regulation FD Disclosure.\nThe Company made a post on X containing a letter to shareholders from Robyn Denholm, Chair of Tesla's Board of Directors, and Kathleen Wilson-Thompson, a Director of Tesla’s Board, the members of the Special Committee, announcing the grant of the 2025 CEO Interim Award on August 4, 2025. A copy of the letter is attached hereto as Exhibit 99.1 and is incorporated herein by reference.\nThis information is intended to be furnished under Item 7.01 of Form 8-K and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act as shall be expressly set forth by specific reference in such a filing.\nForward-Looking Statements\nThe discussions in this Current Report on Form 8-K contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\nForward-looking statements are based on assumptions with respect to the future and management’s current expectations, involve certain risks and uncertainties and are not guarantees.\nThese forward-looking statements include, but are not limited to, (1) statements concerning our plans and expectations regarding the 2025 CEO Interim Award; (2) statements regarding continued CEO retention and incentivization from the 2025 CEO Interim Award; (3) statements regarding the potential benefits, implications, risks or costs of the 2025 CEO Interim Award; (4) statements regarding the anticipated accounting treatment or tax effects of the 2025 CEO Interim Award, including the impact of volatility of markets; and (5) statements regarding our strategy, competition, future operations, future financial position, projected costs, profitability, expectations regarding demand and acceptance for our technologies, growth opportunities and trends in the markets in which we operate, prospects and plans and objectives of management.\nThe words “anticipates,” “believes,” “could,” “estimates,” “expects,” “intends,” “may,” “plans,” “projects,” “will,” “would,” “predicts” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words.\nWe may not actually achieve the plans, intentions or expectations disclosed in our forward-looking statements and you should not place undue reliance on our forward-looking statements. Future results may differ materially from the plans, intentions and expectations disclosed in the forward-looking statements that we make.\nThese forward-looking statements involve risks and uncertainties that could cause our actual results to differ materially from those in the forward-looking statements, including, without limitation, the risks set forth in Part I, Item 1A, “Risk Factors” of the Annual Report on Form 10-K for the fiscal year ended December 31, 2024, in Part II, Item 1A, “Risk Factors” of the Quarterly Report on Form 10-Q for the fiscal quarter ended March 31, 2025, in Part II, Item 1A, “Risk Factors” of the Quarterly Report on Form 10-Q for the fiscal quarter ended June 30, 2025, and that are otherwise described or updated from time to time in our other filings with the SEC. The discussion of such risks is not an indication that any such risks have occurred at the time of this filing. We do not assume any obligation to update any forward-looking statements.",
    "item_8.01": "",
    "item_9.01": "Item 9.01 Financial Statements and Exhibits.\n(d) Exhibits.\nExhibit No.\nDescription\n10.1\n2025 CEO Interim Restricted Stock Agreement, dated August 3, 2025.\n99.1\nShareholder Letter, dated August 4, 2025\nCover Page Interactive Data File (embedded within the Inline XBRL document)."
}