{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2025-11-07",
    "period_of_report": "2025-11-06",
    "sic": "3711",
    "state_of_inc": "TX",
    "state_location": "TX",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0001104659-25-108507-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000110465925108507/tm2530590d1_8k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0001104659-25-108507.txt",
    "filename": "1318605_8K_2025_0001104659-25-108507.htm",
    "item_1.01": "",
    "item_1.02": "",
    "item_1.03": "",
    "item_1.04": "",
    "item_1.05": "",
    "item_2.01": "",
    "item_2.02": "",
    "item_2.03": "",
    "item_2.04": "",
    "item_2.05": "",
    "item_2.06": "",
    "item_3.01": "",
    "item_3.02": "",
    "item_3.03": "",
    "item_4.01": "",
    "item_4.02": "",
    "item_5.01": "",
    "item_5.02": "Item 5.02 Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers.\n(e)\nA&R 2019 Equity Incentive Plan\nOn November 6, 2025, the shareholders of Tesla, Inc. (“Tesla”) approved the amended and restated Tesla, Inc. 2019 Equity Incentive Plan (the “A&R 2019 Equity Incentive Plan”) at Tesla’s 2025 Annual Meeting of Shareholders (the “Annual Meeting”) as described below in Item 5.07 to this Current Report.\nThe material terms of the A&R 2019 Equity Incentive Plan were previously described in the section titled “Tesla Proposal for Approval of the A&R 2019 Equity Incentive Plan - Summary of the A&R 2019 Equity Incentive Plan” in Tesla’s Proxy Statement on Schedule 14A filed with the Securities and Exchange Commission (the “SEC”) on September 17, 2025 (the “Proxy Statement”). Such disclosure is hereby incorporated by reference into this Current Report on Form 8-K and is filed as Exhibit 99.1 hereto.\nThe foregoing description of the A&R 2019 Equity Incentive Plan is qualified by reference to the A&R 2019 Equity Incentive Plan, which is filed as Exhibit 10.1 hereto and incorporated herein by reference.\n2025 CEO Performance Award\nAs previously disclosed, on September 3, 2025, Tesla granted Elon Musk, Tesla’s Chief Executive Officer, a performance-based restricted stock award (the “2025 CEO Performance Award”), subject to receipt of certain approvals. On November 6, 2025, Tesla’s shareholders approved the 2025 CEO Performance Award at the Annual Meeting as described below in Item 5.07 to this Current Report.\nThe material terms of the 2025 CEO Performance Award were previously described in the section titled “Tesla Proposal for Approval of the 2025 CEO Performance Award - Summary of the Proposed 2025 CEO Performance Award - Overview” in the Proxy Statement. Such disclosure is hereby incorporated by reference into this Current Report on Form 8-K and is filed as Exhibit 99.2 hereto.\nThe foregoing description of the 2025 CEO Performance Award is qualified by reference to the 2025 CEO Performance Award, which is filed as Exhibit 10.2 hereto and incorporated herein by reference.",
    "item_5.03": "",
    "item_5.04": "",
    "item_5.05": "",
    "item_5.06": "",
    "item_5.07": "Item 5.07 Submission of Matters to a Vote of Security Holders.\nAt the Annual Meeting held on November 6, 2025, Tesla’s shareholders voted on the following 14 proposals and Tesla’s inspector of election certified the vote tabulations indicated below.\nProposal 1\nThe individuals listed below were elected as Class III directors at the Annual Meeting to serve on the Board for a term of three years or until their respective successors are duly elected and qualified.\nProposal 2\nProposal 2 was a management proposal to approve executive compensation on a non-binding advisory basis. This proposal was approved.\nProposal 3\nProposal 3 was a management proposal to approve the A&R 2019 Equity Incentive Plan. This proposal was approved.\nProposal 4\nProposal 4 was a management proposal to approve the 2025 CEO Performance Award. This proposal was approved.\nProposal 5\nProposal 5 was a management proposal for the ratification of the appointment of PricewaterhouseCoopers LLP as Tesla’s independent registered public accounting firm for the fiscal year ending December 31, 2025. This proposal was approved.\nProposal 6\nProposal 6 was a management proposal for adoption of amendments to our certificate of formation and bylaws to eliminate applicable supermajority voting requirements. This proposal was not approved.\nProposal 7\nProposal 7 was a shareholder proposal regarding Board authorization of an investment in x.AI Corp. While more votes were cast in favor of the proposal than against, a significant number of shareholders abstained. Since our bylaws generally consider abstention as votes against, this was not approved under the bylaw standard. As a result, given that this is an advisory vote, the Board will examine next steps in light of these voting results (including the high number of abstentions).\nProposal 8\nProposal 8 was a shareholder proposal regarding adopting targets and reporting on metrics to assess the feasibility of integrating sustainability metrics into senior executive compensation plans. This proposal was not approved.\nProposal 9\nProposal 9 was a shareholder proposal requesting a child labor audit. This proposal was not approved.\nProposal 10\nProposal 10 was a shareholder proposal to amend the bylaws to repeal the 3% derivative suit ownership threshold. This proposal was not approved.\nProposal 11\nProposal 11 was a shareholder proposal to amend Article X of the bylaws. This proposal was not approved.\nProposal 12\nProposal 12 was a shareholder proposal to elect each director annually. This proposal was approved.\nProposal 13\nProposal 13 was a shareholder proposal regarding a proposal, which won 54% support at our 2024 annual meeting. This proposal was not approved.\nProposal 14\nProposal 14 was a shareholder proposal to seek shareholder approval before adopting an amendment to the bylaws pursuant to Section 21.373 of the TBOC. This proposal was not approved.",
    "item_5.08": "",
    "item_6.01": "",
    "item_6.02": "",
    "item_6.03": "",
    "item_6.04": "",
    "item_6.05": "",
    "item_7.01": "",
    "item_8.01": "",
    "item_9.01": "Item 9.01 Financial Statements and Exhibits.\n(d) Exhibits.\nExhibit No.\nDescription\n10.1\nTesla, Inc. Amended and Restated 2019 Equity Incentive Plan\n10.2\nTesla, Inc. 2025 CEO Performance Award Agreement, dated as of September 3, 2025\n10.3\nVoting Agreement, dated as of September 3, 2025\n99.1\nExcerpt from Proxy Statement on Schedule 14A dated September 17, 2025 of Tesla, Inc.\n99.2\nExcerpt from Proxy Statement on Schedule 14A dated September 17, 2025 of Tesla, Inc.\nCover Page Interactive Data File (embedded within the Inline XBRL document)."
}