{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2025-07-10",
    "period_of_report": "2025-07-09",
    "sic": "3711",
    "state_of_inc": "TX",
    "state_location": "TX",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0001628280-25-034692-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000162828025034692/tsla-20250709.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0001628280-25-034692.txt",
    "filename": "1318605_8K_2025_0001628280-25-034692.htm",
    "item_1.01": "",
    "item_1.02": "",
    "item_1.03": "",
    "item_1.04": "",
    "item_1.05": "",
    "item_2.01": "",
    "item_2.02": "",
    "item_2.03": "",
    "item_2.04": "",
    "item_2.05": "",
    "item_2.06": "",
    "item_3.01": "",
    "item_3.02": "",
    "item_3.03": "",
    "item_4.01": "",
    "item_4.02": "",
    "item_5.01": "",
    "item_5.02": "",
    "item_5.03": "",
    "item_5.04": "",
    "item_5.05": "",
    "item_5.06": "",
    "item_5.07": "",
    "item_5.08": "Item 5.08 Shareholder Director Nominations.\nThe board of directors (the “Board”) of Tesla, Inc. (“Tesla”) has designated November 6, 2025 as the date of Tesla’s 2025 annual meeting of shareholders (the “2025 Annual Meeting”).\nA shareholder who, in accordance with Rule 14a-8 under the Securities Exchange Act of 1934, as amended (the “Exchange Act”), intends to present a proposal to be included in the proxy statement for the 2025 Annual Meeting must submit the proposal to Tesla, Inc., 1 Tesla Road, Austin, Texas 78725, Attention: Legal Department - Shareholder Mail, with a copy sent by e-mail to shareholdermail@tesla.com, and we must receive the proposal by no later than a reasonable time before we begin to print and mail the proxy materials for the 2025 Annual Meeting. Accordingly, the Board has fixed the new deadline for the submission of proposals to be included in the proxy statement for the 2025 Annual Meeting as July 31, 2025. Shareholders who previously have submitted proposals for the 2025 Annual Meeting in accordance with Rule 14a-8 under the Exchange Act should not resubmit. In addition, we may omit any proposal from our proxy materials that does not comply with Securities and Exchange Commission rules.\nPursuant to Tesla’s bylaws, if a shareholder intends to present certain matters, including nominations for the election of directors, at the 2025 Annual Meeting without inclusion in our proxy materials, the notice must also be delivered to our principal executive offices, at the address and email set forth above, no earlier than July 9, 2025 and no later than August 8, 2025. The proposal or nomination must also contain the information and follow the procedures required by our bylaws.",
    "item_6.01": "",
    "item_6.02": "",
    "item_6.03": "",
    "item_6.04": "",
    "item_6.05": "",
    "item_7.01": "",
    "item_8.01": "",
    "item_9.01": ""
}