{
    "cik": "1652044",
    "company": "Alphabet Inc.",
    "filing_type": "8-K",
    "filing_date": "2025-03-18",
    "period_of_report": "2025-03-18",
    "sic": "7370",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1652044/0001652044-25-000027-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1652044/000165204425000027/goog-20250318.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1652044/0001652044-25-000027.txt",
    "filename": "1652044_8K_2025_0001652044-25-000027.htm",
    "item_1.01": "",
    "item_1.02": "",
    "item_1.03": "",
    "item_1.04": "",
    "item_1.05": "",
    "item_2.01": "",
    "item_2.02": "",
    "item_2.03": "",
    "item_2.04": "",
    "item_2.05": "",
    "item_2.06": "",
    "item_3.01": "",
    "item_3.02": "",
    "item_3.03": "",
    "item_4.01": "",
    "item_4.02": "",
    "item_5.01": "",
    "item_5.02": "",
    "item_5.03": "",
    "item_5.04": "",
    "item_5.05": "",
    "item_5.06": "",
    "item_5.07": "",
    "item_5.08": "",
    "item_6.01": "",
    "item_6.02": "",
    "item_6.03": "",
    "item_6.04": "",
    "item_6.05": "",
    "item_7.01": "Item 7.01. Regulation FD Disclosure.\nAcquisition of Wiz, Inc.\nOn March 18, 2025, Google LLC (“Google”), a subsidiary of Alphabet Inc., announced that it had entered into a definitive agreement pursuant to which Google will acquire Wiz, Inc. (“Wiz”), a leading cloud security platform, for $32 billion, subject to closing adjustments, in an all-cash transaction. The acquisition of Wiz is expected to close in 2026, subject to customary closing conditions, including the receipt of regulatory approvals. Upon the closing of the acquisition, Wiz will become part of the Google Cloud segment.\nPress Release and Investor Presentation\nOn March 18, 2025, Google issued a press release (the “Press Release”) in connection with the announcement of the acquisition. A copy of the Press Release is attached as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated into this Item 7.01 by reference.\nAlso on March 18, 2025, representatives of Google and Wiz will make available an investor presentation (the “Investor Presentation”) regarding the acquisition to investors. A copy of the Investor Presentation is attached as Exhibit 99.2 to this Current Report on Form 8-K and incorporated into this Item 7.01 by reference.\nThe information in Item 7.01 of this Current Report on Form 8-K, including Exhibit 99.1 and Exhibit 99.2, shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liability of that section, and shall not be incorporated by reference into any registration statement or other document filed under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such filing.",
    "item_8.01": "Item 8.01. Other Events.\nThe information appearing under the heading “Acquisition of Wiz, Inc.” contained in Item 7.01 of this Current Report on Form 8-K is incorporated by reference into this Item 8.01.\nForward-Looking Statements\nThis Current Report on Form 8-K includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 regarding the acquisition of Wiz by Google. These forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties, which could cause Alphabet Inc.'s (the “company”, “we”, “us” or “our”) actual results to differ materially from those reflected in the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, the risk that the closing conditions for the acquisition will not be satisfied, including the risk that the requisite regulatory approvals will not be obtained; the risk that the definitive agreement relating to the acquisition will be terminated prior to closing; the possibility that the acquisition will not be completed in the expected timeframe or at all; potential adverse effects to the businesses of the company or Wiz during the pendency of the acquisition; our ability to successfully integrate Wiz or other businesses that we may acquire in the future; our ability to achieve the benefits that we expect to realize as a result of the acquisition of Wiz; the potential negative impact on our financial condition and results of operations if we fail to achieve the benefits that we expect to realize as a result of the acquisition of Wiz or if these benefits take longer to achieve than expected; and other risks and uncertainties discussed in the reports the company has filed previously with the SEC, such as its Annual Report on Form 10-K. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, which speak as of the respective date of this Current Report on Form 8-K, except as required by law. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements.",
    "item_9.01": "Item 9.01. Financial Statements and Exhibits.\n(d)Exhibits\nExhibit No. Description\n99.1 Press release of Alphabet Inc. dated March 18, 2025\n99.2 Investor Presentation\n104 Cover Page Interactive Data File (formatted as inline XBRL)"
}