{
    "cik": "320193",
    "company": "Apple Inc.",
    "filing_type": "8-K",
    "filing_date": "2025-05-12",
    "period_of_report": "2025-05-05",
    "sic": "3571",
    "state_of_inc": "CA",
    "state_location": "CA",
    "fiscal_year_end": "0927",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/320193/0001140361-25-018400-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/320193/000114036125018400/ef20048691_8k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/320193/0001140361-25-018400.txt",
    "filename": "320193_8K_2025_0001140361-25-018400.htm",
    "item_1.01": "",
    "item_1.02": "",
    "item_1.03": "",
    "item_1.04": "",
    "item_1.05": "",
    "item_2.01": "",
    "item_2.02": "",
    "item_2.03": "",
    "item_2.04": "",
    "item_2.05": "",
    "item_2.06": "",
    "item_3.01": "",
    "item_3.02": "",
    "item_3.03": "",
    "item_4.01": "",
    "item_4.02": "",
    "item_5.01": "",
    "item_5.02": "",
    "item_5.03": "",
    "item_5.04": "",
    "item_5.05": "",
    "item_5.06": "",
    "item_5.07": "",
    "item_5.08": "",
    "item_6.01": "",
    "item_6.02": "",
    "item_6.03": "",
    "item_6.04": "",
    "item_6.05": "",
    "item_7.01": "",
    "item_8.01": "Item 8.01\nOther Events.\nOn May 12, 2025, Apple Inc. (“Apple”) consummated the issuance and sale of $1,500,000,000 aggregate principal amount of its 4.000% Notes due 2028 (the “2028 Notes”), $1,000,000,000 aggregate principal amount of its 4.200% Notes due 2030 (the “2030 Notes”), $1,000,000,000 aggregate principal amount of its 4.500% Notes due 2032 (the “2032 Notes”) and $1,000,000,000 aggregate principal amount of its 4.750% Notes due 2035 (the “2035 Notes” and, together with the 2028 Notes, the 2030 Notes, and the 2032 Notes, the “Notes”), pursuant to an underwriting agreement (the “Underwriting Agreement”) dated May 5, 2025 among Apple and Goldman Sachs & Co. LLC, Barclays Capital Inc., BofA Securities, Inc. and J.P. Morgan Securities LLC, as representatives of the several underwriters named therein.\nThe Notes are being issued pursuant to an indenture, dated as of November 1, 2024 (the “Indenture”), between Apple and The Bank of New York Mellon Trust Company, N.A., as trustee, together with the officer’s certificate, dated May 12, 2025 (the “Officer’s Certificate”), issued pursuant to the Indenture establishing the terms of each series of Notes.\nThe Notes are being issued pursuant to Apple’s Registration Statement on Form S-3 filed with the Securities and Exchange Commission and dated November 1, 2024 (Reg. No. 333-282937) (the “Registration Statement”).\nInterest on the 2028 Notes, the 2030 Notes, the 2032 Notes, and the 2035 Notes will be paid semi-annually in arrears on May 12 and November 12 of each year, beginning on November 12, 2025.\nThe 2028 Notes will mature on May 12, 2028. The 2030 Notes will mature on May 12, 2030. The 2032 Notes will mature on May 12, 2032. The 2035 Notes will mature on May 12, 2035.\nThe Notes will be Apple’s senior unsecured obligations and will rank equally with Apple’s other unsecured and unsubordinated debt from time to time outstanding.\nThe foregoing description of the Notes and related agreements is qualified in its entirety by the terms of the Underwriting Agreement, the Indenture and the Officer’s Certificate (including the forms of the Notes). Apple is furnishing the Underwriting Agreement and the Officer’s Certificate (including the forms of the Notes) attached hereto as Exhibits 1.1 and 4.1 through 4.5, respectively, and they are incorporated herein by reference. The Indenture is filed as Exhibit 4.1 to the Registration Statement. An opinion regarding the legality of the Notes is filed as Exhibit 5.1, and is incorporated by reference into the Registration Statement; and a consent relating to the incorporation of such opinion is incorporated by reference into the Registration Statement and is filed as Exhibit 23.1 by reference to its inclusion within Exhibit 5.1.",
    "item_9.01": "Item 9.01\nFinancial Statements and Exhibits.\n(d) Exhibits.\nExhibit\nNumber\nExhibit Description\n1.1\nUnderwriting Agreement, dated May 5, 2025, among Apple Inc. and Goldman Sachs & Co. LLC, Barclays Capital Inc., BofA Securities, Inc. and J.P. Morgan Securities LLC, as representatives of the several underwriters named therein\n4.1\nOfficer’s Certificate of Apple Inc., dated May 12,\n4.2\nForm of Global Note representing the 2028 Notes (included in Exhibit 4.1)\n4.3\nForm of Global Note representing the 2030 Notes (included in Exhibit 4.1)\n4.4\nForm of Global Note representing the 2032 Notes (included in Exhibit 4.1)\n4.5\nForm of Global Note representing the 2035 Notes (included in Exhibit 4.1)\n5.1\nOpinion of Latham & Watkins LLP\n23.1\nConsent of Latham & Watkins LLP (included in the opinion filed as Exhibit 5.1)\nInline XBRL for the cover page of this Current Report on Form 8-K"
}